{
  "title": "Accessibility",
  "slug": "accessibility",
  "summary": "Accessibility is central to SEB’s digital experience. The Green Design System is designed to make our services usable for everyone – improving clarity, usability, and overall experience.",
  "sections": [
    {
      "max-width": false,
      "cols": "1",
      "columns": [
        {
          "type": "image",
          "src": "/assets/SEB20241125_Dig0867_v003.jpg"
        }
      ]
    },
    {
      "title": "Inclusive design benefits everyone",
      "tag": "H2",
      "section-content": "Approximately 20% of people experience permanent, temporary, or situational difficulties when using websites that lack accessible design. By creating an inclusive environment, we make it easier for all users to access and understand our content.",
      "max-width": true,
      "cols": "1"
    },
    {
      "title": "Accessibility checklist",
      "tag": "H2",
      "max-width": true,
      "cols": "1",
      "columns": [
        {
          "type": "rich-text",
          "content": "Every component in Green Design System has accessibility in mind. For each component, we review the following areas:\n\n*   Contrast\n    \n*   Keyboard navigation\n    \n*   ARIA & HTML semantics\n    \n*   Focus behaviour\n    \n*   Touch interactions\n    \n*   Screen reader support\n    \n*   Darkmode compatibility"
        }
      ]
    },
    {
      "title": "Contrast",
      "tag": "H2",
      "max-width": true,
      "cols": "1",
      "columns": [
        {
          "type": "rich-text",
          "title": "The importance of high contrast",
          "tag": "H3",
          "content": "High contrast ratios make content easier to read and navigate – especially for users with visual impairments. Strong contrast helps differentiate text, components, and sections on a page. By meeting accessibility standards, we ensure our content works for a wider audience, including those with significant vision difficulties."
        },
        {
          "type": "rich-text",
          "title": "What we check for contrast and colour",
          "tag": "H3",
          "content": "We evaluate the contrast between elements to ensure readability and clarity. Components should have sufficient contrast between text, icons, backgrounds, and borders. Colours must be clearly distinguishable, even for users with colour vision deficiencies. When needed, we also use patterns or icons to support meaning and improve accessibility."
        },
        {
          "type": "rich-text",
          "title": "Tools and standards we follow",
          "tag": "H3",
          "content": "*   **WCAG 2.1 - SC.1.4.3:** Follow contrast ratio of 3:1 to 4.5:1, depending on text size and usage.\n    \n*   **Chrome DevTools:** Use the **Rendering > Emulate vision deficiencies** feature to see how designs appear to users with various vision conditions.\n    \n*   **Silktide (Chrome extension):** Offers a wide range of accessibility tools, including color blindness simulation. Approved for use within SEB.\n    \n*   Contrast checkers: Tools like [WebAIM Contrast Checker](https://webaim.org/resources/contrastchecker/) help you verify if color combinations meet contrast requirements."
        },
        {
          "type": "rich-text",
          "title": "Future high contrast mode",
          "tag": "H3",
          "content": "In addition to the dark mode feature detailed below, we may introduce a high contrast mode in the future. This setting is becoming increasingly common on other websites. While it may not be the most visually appealing, it will enhance readability in poor lighting conditions, on suboptimal screens, or for users with visual impairments."
        }
      ]
    },
    {
      "title": "Keyboard navigation",
      "tag": "H2",
      "max-width": true,
      "cols": "1",
      "columns": [
        {
          "type": "rich-text",
          "content": "We ensure that components can be fully operated using the keyboard. If a component behaves differently from standard keyboard patterns, this should be clearly documented.\n\n*   Components can be activated using **Enter** and/or **Space**, where appropriate.\n    \n*   **Arrow keys** are used for navigation when relevant (e.g. in menus or dropdowns).\n    \n*   If writing text is allowed it should be easy to visibly see that.\n    \n*   If typing is not allowed (for example, in a read-only or locked field), this should be visually obvious and easy to understand.\n    \n*   **Avoid using disabled fields.** They can't be clicked or typed into, often lack context for why they’re inactive, and typically have poor contrast—making them inaccessible and confusing for users."
        }
      ]
    },
    {
      "title": "ARIA & HTML semantics",
      "tag": "H2",
      "max-width": true,
      "cols": "1",
      "columns": [
        {
          "type": "rich-text",
          "content": "We follow correct ARIA attributes and roles, and use semantic HTML as the foundation. ARIA should only be used when necessary - never as a replacement for proper HTML.\n\nCommon mistakes include:\n\n*   **Misspellings** – for example, id values are case-sensitive and must match exactly.\n    \n*   **Overuse** – adding ARIA attributes where they aren't needed can cause confusion for assistive technologies."
        }
      ]
    },
    {
      "title": "Focus behavior",
      "tag": "H2",
      "max-width": true,
      "cols": "1",
      "columns": [
        {
          "type": "rich-text",
          "content": "Proper focus handling is essential for keyboard and screen reader navigation.\n\nWhen focus is implemented correctly:\n\n*   A visible **black focus ring** should appear slightly outside the focused element (typically a few pixels away).\n    \n*   Focus should typically appear when **navigating with the keyboard**, but not when using a mouse (to avoid visual clutter).\n    \n*   The focus indicator must be **clearly visible** – it should not be hidden behind other elements or fall outside the viewport.\n    \n*   The **focus order** should follow a logical sequence: usually starting from the top left, moving to the top right, then continuing downward, left to right.\n    \n*   **Focus traps** should work effectively in pop-ups and modals, keeping the user inside until the interaction is complete. This applies to keyboard, mouse, and screen reader users alike."
        }
      ]
    },
    {
      "title": "Touch interaction",
      "tag": "H2",
      "max-width": true,
      "cols": "1",
      "columns": [
        {
          "type": "rich-text",
          "content": "Interactive elements should be easy to tap and match the visual design. Touch targets must be large enough to avoid mis-taps and support common gestures like pinching, zooming, and scrolling where applicable.\n\n*   The recommended **minimum touch** target size is 44×44 px (WCAG AAA).\n    \n*   WCAG AA allows a minimum size of 24×24 px, if there's at least 44×44 px of clickable space around it.\n    \n*   Touch targets should align with visual cues to avoid confusion or missed interactions.\n    \n\nReferences:\n\n*   [WCAG 2.1: Target Size (AA)](https://www.w3.org/WAI/WCAG21/Understanding/target-size.html)\n    \n*   [WCAG 2.2: Target Size (Minimum)](https://www.w3.org/WAI/WCAG22/Understanding/target-size-minimum.html)\n    \n*   [U.S. Digital Service: Touch Targets](https://accessibility.digital.gov/ux/touch-targets/)"
        }
      ]
    },
    {
      "title": "Screen reader support",
      "tag": "H2",
      "max-width": true,
      "cols": "1",
      "columns": [
        {
          "type": "rich-text",
          "content": "Components should work consistently with screen readers, ensuring a seamless and understandable experience for users who rely on assistive technologies.\n\n*   Higher priority to test with **NVDA** (PC) and **VoiceOver** (macOS/iOS), and lower priority on TalkBack (Android).\n    \n*   Users should be able to **navigate by headings**, as this is one of the most common ways to explore content with a screen reader.\n    \n*   All meaningful content should be read aloud clearly – including labels, states, and instructions. Decorative images or elements without informative value should be marked to be ignored."
        }
      ]
    },
    {
      "title": "Dark mode compatibility",
      "tag": "H2",
      "max-width": true,
      "cols": "1",
      "columns": [
        {
          "type": "rich-text",
          "content": "Check whether the component supports dark mode – and how well it adapts to it.\n\n*   Does anything change when switching to dark mode?\n    \n*   Is the component still fully functional and visually clear?\n    \n*   Are there any broken styles, missing contrasts, or unclear states?\n    \n\nEven if a component appears unchanged, it's important to verify that all colors, icons, and interactions remain accessible and consistent in dark mode."
        }
      ]
    },
    {
      "title": "Summary",
      "tag": "H2",
      "max-width": true,
      "cols": "1",
      "columns": [
        {
          "type": "rich-text",
          "content": "How accessible is the Green Design System?\n\nOverall, the design system is built with accessibility in mind and performs well. However, occasional issues may arise, and new challenges can be reported as the system evolves.\n\nIf you come across an accessibility issue, please help us improve by submitting a report or creating a new issue."
        }
      ]
    },
    {
      "title": "Useful links",
      "tag": "H2",
      "section-content": "Read more about accessibility: the law, the standard, and SEBs recommendations.",
      "max-width": true,
      "cols": "1",
      "columns": [
        {
          "type": "rich-text",
          "content": "*   [European Accessibility Act - EU Commision](https://commission.europa.eu/strategy-and-policy/policies/justice-and-fundamental-rights/disability/union-equality-strategy-rights-persons-disabilities-2021-2030/european-accessibility-act_en)\n    \n*   [WCAG 2.1 - W3C](https://www.w3.org/TR/WCAG21/)\n    \n*   Internal Sharepoint - Accessibility\n    \n*   Internal CX Central - Accessibility"
        }
      ]
    }
  ]
}