{
  "title": "Input",
  "slug": "input",
  "hero_snippet": "hero-input",
  "beta": false,
  "soon": false,
  "summary": "An input lets users enter and edit text or numerical values in forms.",
  "anatomy": true,
  "anatomy-overview": "The input (and other form controls) are divided in sections that are re-used between components.\n\n*   **Header**: Label, label support, contextual help, extended support.\n    \n*   **Body**: The field with leading and trailing slots.\n    \n*   **Footer**: Character counter, dynamic information and error message.",
  "anatomy-list": {
    "anatomyitems": [
      {
        "text": "Label"
      },
      {
        "text": "Label support text"
      },
      {
        "text": "Information icon"
      },
      {
        "text": "Extended label support text"
      },
      {
        "text": "Field container"
      },
      {
        "text": "Input value"
      },
      {
        "text": "Leading icon"
      },
      {
        "text": "Badge"
      },
      {
        "text": "Icon button clear"
      },
      {
        "text": "Carachter counter"
      }
    ]
  },
  "tags": [
    "Form",
    "input"
  ],
  "category": [
    "Components"
  ],
  "platform": {
    "web": true,
    "ios": false,
    "android": false
  },
  "overview": [
    {
      "title": "Variants",
      "section-content": "To be able to use forms in all context's we provide two versions of input fields.\n\n*   **Default**\n    \n*   Coming soon **Floating label** (label inside): Can only be used in specific contexts. Limited features due to accessibility. Read more about how to use the Floating label on the UX text page [Input field floating label](https://seb.io/component/input/ux-text#input-field-floating-label-5)",
      "columns": [
        {
          "type": "figma",
          "caption": "Default",
          "node": "variant-default"
        },
        {
          "type": "figma",
          "caption": "Floating label",
          "node": "variant-floating-label"
        }
      ]
    },
    {
      "cols": "2",
      "columns": [
        {
          "type": "rich-text",
          "title": "Sizes",
          "content": "The input field comes in two sizes.\n\n*   **Large**\n    \n*   **Small**: used in tables and in some special cases where the space is very limited."
        },
        {
          "type": "figma",
          "caption": "Large and small input field.",
          "node": "large-small-input"
        }
      ]
    },
    {
      "title": "Features",
      "cols": "2",
      "columns": [
        {
          "type": "rich-text",
          "title": "Label",
          "tag": "H3",
          "content": "All input fields must have a label to ensure clarity and accessibility. Labels help users understand the purpose of the field, including those using assistive technologies."
        },
        {
          "type": "figma",
          "caption": "Large input field with a label.",
          "node": "label"
        },
        {
          "type": "rich-text",
          "title": "Optional field indicator",
          "tag": "H3",
          "content": "We only ask for required information. If some fields are optional, we let users know by adding \"(optional)\" in brackets next to the field label."
        },
        {
          "type": "figma",
          "caption": "Use '(optional)' to mark optional fields.",
          "node": "optional-field-indicator"
        },
        {
          "type": "rich-text",
          "title": "Support text",
          "tag": "H3",
          "content": "Use this to explain how to fill in the field, for example how to count or what to include."
        },
        {
          "type": "figma",
          "caption": "Label support text.",
          "node": "support-text"
        }
      ]
    },
    {
      "title": "Contextual help",
      "section-content": "If the label and support text are not enough to explain a field, we can use the info icon. Clicking the icon shows additional support text between the label support and the field.\n\n*   Use a tooltip if space is limited.\n    \n*   Use a modal for large amounts of text.",
      "cols": "2",
      "columns": [
        {
          "type": "figma",
          "caption": "Use the info icon to show more support text.",
          "node": "info-icon-button"
        },
        {
          "type": "figma",
          "caption": "Extended support expanded.",
          "node": "extended-suppport"
        }
      ]
    },
    {
      "title": "Leading icon",
      "section-content": "A leading icon visually reinforces the purpose of the field, helping users to understand what type of information is needed. For example: search fields or card number.",
      "cols": "2",
      "columns": [
        {
          "type": "figma",
          "caption": "Leading icon to indicate it's a search field.",
          "node": "leading-search"
        },
        {
          "type": "figma",
          "caption": "Leading icon to indicate a card number.",
          "node": "leading-card-number"
        },
        {
          "type": "rich-text",
          "title": "Clearable",
          "tag": "H3",
          "content": "To make it easy for users to clear a field, an x-icon button can be placed at the end of the field. This is commonly used in search/filter forms."
        },
        {
          "type": "figma",
          "caption": "Makes it easy to clear a field.",
          "node": "clear-a-search-field"
        },
        {
          "type": "rich-text",
          "title": "Badge",
          "tag": "H3",
          "content": "Use it to show what the unit input value is.\n\nFor example: EUR"
        },
        {
          "type": "figma",
          "caption": "Badge used to display the currency EUR.",
          "node": "currency-badge"
        },
        {
          "type": "rich-text",
          "title": "Error message",
          "tag": "H3",
          "content": "Used to indicate that a selection must be made from the dropdown or that there is an error with the selected option."
        },
        {
          "type": "figma",
          "caption": "Input field containing an error.",
          "node": "field-error"
        }
      ]
    },
    {
      "cols": "2",
      "columns": [
        {
          "type": "rich-text",
          "title": "Character counter",
          "content": "For fields with a character limit, a counter can be added to show users how many characters they have left.\n\nThe counter starts with the maximum allowed characters. As the user types, the remaining characters decrease. When the limit is nearly reached, the counter turns yellow. When or if the user exceeds the limit, the counter turns red.\n\nIf the user ignores this and attempts to submit, an error message will appear indicating that the maximum character limit has been reached."
        },
        {
          "type": "figma",
          "caption": "Input field with the character counter.",
          "node": "character-counter"
        }
      ]
    },
    {
      "cols": "2",
      "columns": [
        {
          "type": "rich-text",
          "title": "Dynamic information",
          "content": "(Not available for Floating label variant) Used to perform comparative calculations next to the field."
        },
        {
          "type": "figma",
          "caption": "Dynamic information displayed under the input field.",
          "node": "dynamic-info"
        },
        {
          "type": "rich-text",
          "title": "Static data",
          "tag": "H3",
          "content": "Used to display static data in a form or compilation. This approach is preferred over disabling fields, which can be problematic for accessibility."
        },
        {
          "type": "figma",
          "caption": "Example usage of static data.",
          "node": "static-data"
        },
        {
          "type": "rich-text",
          "title": "Placeholder",
          "tag": "H3",
          "content": "Avoid using placeholder text (also known as watermark), as it can confuse users into thinking the field is already filled with data. Instructions should not be placed in the field, as they disappear once the user starts typing. Instead, use support text to guide users on what should be entered."
        },
        {
          "type": "figma",
          "caption": "Don't use placeholder text.",
          "node": "placeholder"
        }
      ]
    },
    {
      "title": "Do’s and dont’s",
      "cols": "2",
      "columns": [
        {
          "type": "do",
          "dolist": [
            {
              "text": "Use '(optional)' to mark optional fields"
            }
          ]
        },
        {
          "type": "dont",
          "dontlist": [
            {
              "text": "Don't use asterix to indicate mandatory fields."
            }
          ]
        },
        {
          "type": "figma",
          "caption": "do",
          "node": "do"
        },
        {
          "type": "figma",
          "caption": "dont",
          "node": "dont"
        }
      ]
    }
  ],
  "ux-text": [
    {
      "title": "Input field default",
      "tag": "H2",
      "section-content": "Our default input field has the label outside the field. This input field includes all the features we need in complex forms, and therefore it’s the most common."
    },
    {
      "title": "Labels",
      "tag": "H2",
      "section-content": "The same writing principles apply to labels for input fields, radio buttons, checkboxes, dropdowns, headings, page titles, navigation links, and other short texts."
    },
    {
      "title": "Skip the verb in the label",
      "tag": "H3",
      "section-content": "You don’t need to use verbs such as \"Enter\", \"Fill in\", \"Write\", or \"Choose\" in the label. For instance it’s shorter and easier to read \"Recipient’s name\" instead of \"Fill in the recipient’s name\".\n\nAn exception to the rule is labels for search fields, where the text often uses the verb “Search” or a verb + noun, such as “Search industry”.",
      "cols": "1"
    },
    {
      "title": "Label support text",
      "tag": "H3",
      "section-content": "Use the label support text to explain the label more in detail. Use only if the label isn’t clear enough. Explain what the customer needs to know to fill in the field or understand the data displayed. Be brief.",
      "cols": "2",
      "columns": [
        {
          "type": "figma",
          "caption": "The label support text.",
          "node": "label-support-text"
        }
      ]
    },
    {
      "title": "Single-word or complete sentence",
      "tag": "H3",
      "section-content": "The texts should be as short as possible. Labels can contain single-words, complete sentences or query format.",
      "cols": "2",
      "columns": [
        {
          "type": "figma",
          "caption": "Single-word example (English).",
          "node": "single-or-complete-1"
        },
        {
          "type": "figma",
          "caption": "Single-word example (Swedish).",
          "node": "single-or-complete-2"
        },
        {
          "type": "figma",
          "caption": "Complete sentence example (English).",
          "node": "single-or-complete-3"
        },
        {
          "type": "figma",
          "caption": "Complete sentence example (Swedish).",
          "node": "single-or-complete-4"
        },
        {
          "type": "figma",
          "caption": "Query format example (English).",
          "node": "query-format-1"
        },
        {
          "type": "figma",
          "caption": "Query format example (Swedish).",
          "node": "query-format-2"
        }
      ]
    },
    {
      "title": "Write the time period in the label",
      "tag": "H3",
      "section-content": "Don’t put time periods like month or year in a badge inside the field. Instead, add them to the label. This information is important for the user to be able to fill in the field correctly, and should not be hidden in a small badge.",
      "cols": "2",
      "columns": [
        {
          "type": "figma",
          "node": "time-period-do-eng"
        },
        {
          "type": "figma",
          "node": "time-period-do-swe"
        },
        {
          "type": "figma",
          "node": "time-period-dont-eng"
        },
        {
          "type": "figma",
          "node": "time-period-dont-swe"
        }
      ]
    },
    {
      "title": "Avoid fixed text inside the field",
      "tag": "H2",
      "section-content": "A general UX writing principle is to never hide important text or place it where it’s hard to read. It’s easier to read text in the label or label support text than text within the field. Therefore we avoid having fixed text in the field except when we ask for an amount, or if you use the floating label input."
    },
    {
      "title": "Display the currency with a badge",
      "tag": "H3",
      "section-content": "An exception to the rule is when we ask the customer to fill in an amount, then we don’t include the currency in the label. Instead, a badge inside the input field could display the currency, e.g., kr, EUR.\n\nIn most cases, we only ask for one currency per context, and users usually know which one it is. Therefore, a badge is enough to show the required currency. Remember that the abbreviated kr or EUR in the badge must be read as the full word, kronor or euro, by a screen reader.",
      "cols": "2",
      "columns": [
        {
          "type": "figma",
          "caption": "Display the currency with a badge (English)",
          "node": "no-kronor-eng"
        },
        {
          "type": "figma",
          "caption": "Display the currency with a badge (Swedish)",
          "node": "no-kronor-swe"
        }
      ]
    },
    {
      "title": "Placeholder text",
      "tag": "H3",
      "section-content": "Don’t use placeholder text. Since the placeholder text lies within the input field and disappears when the user starts entering text, it’s not very accessible. If the user needs information about how to fill in the field, use the label support text instead."
    },
    {
      "title": "Labels do’s and dont’s",
      "cols": "2",
      "columns": [
        {
          "type": "rich-text",
          "title": "Do",
          "tag": "H3",
          "content": "*   Use single words, complete sentences or the query format for the label.\n    \n*   If needed, use the label support text to explain the field.\n    \n*   The texts should be brief, clear, and informative."
        },
        {
          "type": "rich-text",
          "title": "Don't",
          "tag": "H3",
          "content": "*   Don't use verbs in the label.\n    \n*   Don't use placeholder text.\n    \n*   Don't use too many characters."
        }
      ]
    },
    {
      "title": "Error message",
      "section-content": "Provide a constructive suggestion on how to solve the problem by telling what the customer needs to adjust."
    },
    {
      "title": "Input field floating label",
      "section-content": "This variant of the input field, with the label inside the field and label support text below, should only be used when the label is a single word or kept in one line, such as \"Email address\" or \"Personal identity number\".\n\nIf an error occurs, the label support text will be replaced with the error message. Therefore, it’s important that the error message includes the label text and the information in the label support text.",
      "cols": "2",
      "columns": [
        {
          "type": "figma",
          "caption": "Input field floating label, enabled and filled.",
          "node": "floating-1"
        },
        {
          "type": "figma",
          "caption": "Input field floating label, enabled and filled in error state.",
          "node": "floating-2"
        }
      ]
    },
    {
      "title": "Do’s and dont’s input field floating label",
      "tag": "H3",
      "cols": "2",
      "columns": [
        {
          "type": "figma",
          "node": "floating-do-eng"
        },
        {
          "type": "figma",
          "node": "floating-do-swe"
        },
        {
          "type": "figma",
          "node": "floating-dont-eng"
        },
        {
          "type": "figma",
          "node": "floating-dont-swe"
        }
      ]
    },
    {
      "title": "Default or floating label?",
      "section-content": "Since our forms mostly contain inputs with labels that need to be a sentence rather than only a single word, most contexts should use the regular input field. The label also often needs supporting text and this is much more user friendly in the default variant.\n\nBefore you choose think about this:\n\n*   Will there be any fields with longer labels?\n    \n*   Will my labels need the supporting text in some cases?\n    \n\nor\n\n*   Is my form only a short one with simple single word label inputs?\n    \n*   Do the labels talk for themselves and don’t need the supporting text? If an error occurs, the label support text will be replaced with the error text.\n    \n\n**Remember – don’t mix the two variants in the same context!**"
    }
  ]
}