{
  "title": "Colours",
  "slug": "primitives/colours",
  "summary": "Colour is a powerful tool in design, shaping hierarchy, guiding attention, and reinforcing brand identity. In Green, colours work alongside whitespace and typography to create clarity and balance.",
  "sections": [
    {
      "max-width": false,
      "cols": "1",
      "columns": [
        {
          "type": "image",
          "src": "/assets/colors_hero.jpg"
        }
      ]
    },
    {
      "title": "Designing with colors",
      "max-width": true,
      "cols": "1",
      "columns": [
        {
          "type": "paragraph",
          "text": "Based on our brand colors, we have developed a comprehensive palette of tints for each one. These extended palettes allow for greater versatility and nuance, ensuring consistency and depth across all visual elements."
        },
        {
          "type": "image",
          "src": "/assets/palette_colors.png"
        }
      ]
    },
    {
      "max-width": true,
      "cols": "1",
      "columns": [
        {
          "type": "paragraph",
          "text": "Maintaining a balanced and engaging interface requires thoughtful color usage. Our approach ensures that color enhances usability, guides attention, and maintains harmony throughout the design system. By leveraging our extended palettes, we create clear visual hierarchies, accommodate accessible contrast levels, and bring cohesion to both functional and expressive design elements."
        },
        {
          "type": "paragraph",
          "tag": "p",
          "text": "All colors in Green are carefully translated to work in both light and dark modes, ensuring consistency and accessibility across different themes. This adaptation preserves contrast, readability, and the overall visual integrity of the interface, no matter the user’s preferred mode."
        }
      ]
    },
    {
      "title": "GDS colour levels",
      "max-width": true,
      "cols": "1",
      "columns": [
        {
          "type": "paragraph",
          "tag": "p",
          "text": "The Green Design System (GDS) colors are structured into three levels, ensuring clarity and consistency across UI elements. "
        },
        {
          "type": "paragraph",
          "tag": "p",
          "text": "This structured approach ensures clear visual hierarchy, making it easy to design interfaces with depth and contrast while maintaining flexibility across different layouts."
        },
        {
          "type": "paragraph",
          "tag": "p",
          "text": "Background tokens are grouped by their level in the interface:\nL1 – the base layer of the screen\nL2 – structural layers like cards and modals\nL3 – backgrounds for components like buttons and inputs.  \nThis structure supports clarity, consistency, and a clear visual hierarchy."
        }
      ]
    }
  ]
}