{
  "title": "Context menu",
  "slug": "context-menu",
  "hero_snippet": "hero-context-menu",
  "beta": false,
  "summary": "A context menu displays a list of contextual actions.",
  "preamble": "Context menu provides a compact menu of contextual actions relevant to a specific item, row, or element within an interface, such as a table, list, or card. Triggered by a dedicated button (e.g., a \"More\" or three-dot icon), it appears as a popover, offering a focused set of options like edit, delete, copy, or share. The context menu enhances user efficiency by surfacing relevant actions directly tied to the selected item, reducing clutter and improving accessibility.",
  "anatomy": true,
  "anatomy-overview": "Context menu consists of an icon button with three dots (but the content can be changed to anything) and a popover with a menu of actions which is presented when the button is activated.",
  "anatomy-details": "1.  Action menu items\n    \n2.  Popover card\n    \n3.  Icon button",
  "tags": [
    "navigation"
  ],
  "platform": {
    "web": true,
    "ios": false,
    "android": false
  },
  "overview": [
    {
      "title": "Features",
      "columns": [
        {
          "type": "paragraph",
          "tag": "p",
          "text": "- Customizable content in trigger button\n- Menu items can be customized and contain other components such as layout or icons\n- Label can be visually displayed, or hidden but still available to screen readers."
        }
      ]
    },
    {
      "title": "Guidelines",
      "tag": "H2",
      "cols": "1",
      "columns": [
        {
          "type": "rich-text",
          "content": "Use the context menu to give users all the options when you can’t fit them in the regular view, or to avoid cluttering the interface.\n\n#### Destructive items\n\nSome items in the menu may be destructive. Typical example is Delete. These items behave like the delete-button and should be displayed in red."
        },
        {
          "type": "rich-text",
          "title": "Do's and Don'ts",
          "tag": "H3",
          "content": "#### Do\n\n*   **Keep Actions Relevant**: Include only actions directly related to the specific item or row (e.g., \"Edit\", \"Delete\") to maintain focus and clarity.\n    \n*   **Use Clear Labels**: Ensure menu items have concise, descriptive text and if possible, recognizable icons, to make actions immediately understandable.\n    \n*   Always set a label for the context menu itself\n    \n\n#### Don't\n\n*   **Overload with Options**: Avoid including too many actions, as long menus can confuse users and slow down interaction.\n    \n*   **Block Content**: Avoid positioning the context menu in a way such that the popover covers critical interface elements or makes the menu hard to access.\n    \n*   Use Context menu if there is only one menu item\n    \n*   Hide critical functionality in Context menu"
        }
      ]
    }
  ]
}