{
  "title": "Link",
  "slug": "link",
  "hero_snippet": "hero-link",
  "beta": false,
  "soon": false,
  "summary": "A link navigates users to other pages or sections of content.",
  "preamble": "The link component is used to navigate users to other pages, sections, or external resources. It provides a consistent, accessible way to present clickable text within content, helping users understand where a link will take them.",
  "anatomy": true,
  "anatomy-list": {
    "anatomyitems": [
      {
        "text": "Link text"
      },
      {
        "text": "Leading icon"
      },
      {
        "text": "Trailing icon"
      },
      {
        "text": "Text decoration"
      }
    ]
  },
  "tags": [
    "navigation",
    "editorial"
  ],
  "category": [
    "Components"
  ],
  "platform": {
    "web": true,
    "ios": false,
    "android": false
  },
  "overview": [
    {
      "title": "Usage",
      "tag": "H2",
      "section-content": "Use links for navigation whether it’s within the same page, across pages, or to external sites. A good link is easy to recognize, descriptive, and accessible. It should clearly communicate where it will take the user, even when read out of context (for example, by a screen reader). Avoid using links for actions such as submitting forms or opening modals use buttons instead."
    },
    {
      "title": "Variants",
      "tag": "H2",
      "cols": "2",
      "columns": [
        {
          "type": "rich-text",
          "title": "Leading icon",
          "tag": "H3",
          "content": "Use when an icon helps reinforce the meaning of the link (e.g., a document or download icon before the text)."
        },
        {
          "type": "snippet",
          "plain": false,
          "replay": false,
          "Snippet": "link-leading"
        },
        {
          "type": "rich-text",
          "title": "Trailing icon",
          "tag": "H3",
          "content": "Use for links that lead to another page or outside the current application, such as external websites."
        },
        {
          "type": "snippet",
          "plain": false,
          "replay": false,
          "Snippet": "link-trailing"
        },
        {
          "type": "rich-text",
          "title": "Text decoration",
          "tag": "H3",
          "content": "Used when a stronger visual indication is needed for example, in long bodies of text or when links need to stand out clearly from surrounding content."
        },
        {
          "type": "snippet",
          "plain": false,
          "replay": false,
          "Snippet": "link-text-decoration"
        }
      ]
    },
    {
      "title": "Do’s and don’ts",
      "cols": "2",
      "columns": [
        {
          "type": "do",
          "dolist": [
            {
              "text": "Use links only for navigation, not for actions."
            },
            {
              "text": "Ensure link text is clear, concise, and descriptive (e.g. “View account details” instead of “Click here”)."
            },
            {
              "text": "Use icons to clarify the link’s function, especially for external links or downloads."
            },
            {
              "text": "Ensure links are accessible: high contrast, visible focus state, and screen-reader friendly."
            }
          ]
        },
        {
          "type": "dont",
          "dontlist": [
            {
              "text": "Don't use vague link texts like “Click here” or “Read more” without context."
            },
            {
              "text": "Don't use links to trigger actions like opening modals, submitting forms, or toggling UI use buttons instead."
            },
            {
              "text": "Don't overload an interface with too many link styles it can confuse users."
            }
          ]
        }
      ]
    }
  ],
  "ux-text": [
    {
      "title": "Use a verb that describes the user’s action",
      "tag": "H2",
      "section-content": "If the user is supposed to perform an action when clicking the link, try to use a verb in the active form that describes the action. It's fine to use two verb phrases, if the user must log in or go to a page to read more before performing the main action.\n\nNever use the phrase \"click here\". Neither by itself nor in a longer phrase. It makes it unclear to the user what will happen. \"Click here\" links are also inaccessible for users with screen readers. Furthermore, \"click here\" doesn't work for users that don't use a mouse or use a phone or tablet to navigate the site."
    },
    {
      "title": "Upper and lower case",
      "tag": "H3",
      "section-content": "Don't start each word in headings and labels with upper case. Only use upper case in:\n\n*   The first letter of the first word\n    \n*   The first letter of proper names\n    \n*   Abbreviations"
    },
    {
      "columns": [
        {
          "type": "do",
          "dolist": [
            {
              "text": "Start saving for your pension (This needs to be formatted as links)"
            },
            {
              "text": "Read more about mortgages (This needs to be formatted as links)"
            },
            {
              "text": "Become a corporate customer (This needs to be formatted as links)"
            },
            {
              "text": "Log in and invest (This needs to be formatted as links)"
            },
            {
              "text": "Read more and apply for a mortgage (This needs to be formatted as links)"
            }
          ]
        },
        {
          "type": "dont",
          "dontlist": [
            {
              "text": "Click here or Click here (These needs to be formatted as links see design library)"
            },
            {
              "text": " Click here for more information about mortgage"
            }
          ]
        }
      ]
    },
    {
      "title": "Include only the necessary words",
      "tag": "H2",
      "section-content": "Sometimes the link can be a complete sentence, but don't make the sentence too long. Never include several sentences. Don't include preceding articles or punctuation mark."
    },
    {
      "columns": [
        {
          "type": "do",
          "dolist": [
            {
              "text": "Unfortunately, this feature does not work in the browser Internet Explorer. Here you can read about the browsers we recommend. (\"browser recommended needs to look like a link)"
            }
          ]
        },
        {
          "type": "dont",
          "dontlist": [
            {
              "text": "Unfortunately, this feature does not work in the browser Internet Explorer. Here you can read about the browsers we recommend. (Here you can read about the browsers we recommend. needs to look like a link)"
            }
          ]
        }
      ]
    },
    {
      "title": "Should I place the link in or after the text?",
      "tag": "H3",
      "section-content": "The purpose of the text decides the placement of the links. If the user is supposed to read the text in its entirety, place the link after the text or in a separate link list. If the user reads the text to act, you can place the links directly in the text."
    },
    {
      "title": "Link in the text",
      "tag": "H4",
      "section-content": "When the purpose of the text is to help the user navigate forward, you can put the link directly in the text.\n\n*   You can find the agreement under [**My agreements**](https://designlibrary.sebgroup.com/components/component-link/)."
    },
    {
      "title": "Link outside of the text",
      "tag": "H4",
      "section-content": "Follow us on Twitter and LinkedIn to get the latest insight on corporate, institutional and investment banking. [Follow us on Social media](https://designlibrary.sebgroup.com/components/component-link/)"
    },
    {
      "title": "Add items to a list",
      "tag": "H4",
      "section-content": "Although links are primarily to be used for navigation, it happens that we use linked design for actions that the customer can perform. When the link indicates that it can add more of the same item to a list, you may begin the link text with a plus sign. For instance: [\\+ Add another company](https://designlibrary.sebgroup.com/components/component-link/)\n\nHowever, links that indicate that the user can delete an item should not begin with a minus."
    },
    {
      "columns": [
        {
          "type": "do",
          "dolist": [
            {
              "text": "+ Add a new country"
            }
          ]
        },
        {
          "type": "dont",
          "dontlist": [
            {
              "text": "- Delete the country"
            }
          ]
        }
      ]
    }
  ]
}