{
  "title": "Link",
  "slug": "link",
  "hero_snippet": "hero-link",
  "beta": false,
  "summary": "A link navigates users to other pages or sections of content.",
  "preamble": "The link component is used to navigate users to other pages, sections, or resources. It plays a key role in guiding users through the interface and must be designed for clarity, accessibility, and consistency.",
  "anatomy": true,
  "anatomy-list": {
    "anatomyitems": [
      {
        "text": "Link text"
      },
      {
        "text": "Leading icon"
      },
      {
        "text": "Trailing icon"
      },
      {
        "text": "Link decoration"
      }
    ]
  },
  "tags": [
    "navigation",
    "editorial"
  ],
  "category": [
    "Components"
  ],
  "platform": {
    "web": true,
    "ios": false,
    "android": false
  },
  "overview": [
    {
      "title": "Usage",
      "tag": "H2",
      "section-content": "Use links for navigation — whether it’s within the same page, across pages, or to external sites. A good link is easy to recognize, descriptive, and accessible. It should clearly communicate where it will take the user, even when read out of context (for example, by a screen reader). Avoid using links for actions such as submitting forms or opening modals — use buttons instead."
    },
    {
      "title": "Variants",
      "tag": "H2",
      "section-content": "**With leading icon** - Use when an icon helps reinforce the meaning of the link (e.g., a document or download icon before the text).  \n**With trailing icon** - Use for links that lead outside the current system, such as external websites. A trailing external link icon helps set expectations.  \n**With underline** - Used when a stronger visual indication is needed — for example, in long bodies of text or when links need to stand out clearly from surrounding content."
    },
    {
      "title": "Do’s and don’ts",
      "tag": "H2",
      "cols": "2",
      "columns": [
        {
          "type": "rich-text",
          "title": "Do",
          "tag": "H3",
          "content": "*   Use links only for navigation, not for actions.\n    \n*   Ensure link text is clear, concise, and descriptive (e.g. “View account details” instead of “Click here”).\n    \n*   Use icons to clarify the link’s function, especially for external links or downloads.\n    \n*   Ensure links are accessible: high contrast, visible focus state, and screen-reader friendly."
        },
        {
          "type": "rich-text",
          "title": "Don´t",
          "tag": "H3",
          "content": "*   use vague link texts like “Click here” or “Read more” without context.\n    \n*   use links to trigger actions like opening modals, submitting forms, or toggling UI—use buttons instead.\n    \n*   overload an interface with too many link styles—it can confuse users.\n    \n*   forget to test links in both light and dark modes for contrast and visibility."
        }
      ]
    }
  ]
}