{
  "title": "Filter chips",
  "slug": "filter-chips",
  "hero_snippet": "hero-filter-chips",
  "beta": false,
  "soon": false,
  "summary": "Filter chips allow users to narrow down the data they want to see on the page.",
  "preamble": "The filter chip lets users narrow down visible content by selecting or removing specific filters. It helps refine results without navigating away from the page.",
  "anatomy": true,
  "anatomy-list": {
    "anatomyitems": [
      {
        "text": "Chips container"
      },
      {
        "text": "Label text"
      },
      {
        "text": "Trailing icon (selected)"
      },
      {
        "text": "Icon button remove"
      },
      {
        "text": "Leading icon"
      }
    ]
  },
  "tags": [
    "filter",
    "button"
  ],
  "category": [
    "Components"
  ],
  "platform": {
    "web": true,
    "ios": false,
    "android": false
  },
  "overview": [
    {
      "title": "Variants",
      "tag": "H2",
      "section-content": "The filter chip component comes in two variants, each supporting a different stage of the filtering experience:\n\n*   **Selectable** – The default state, displaying only a label. Use this variant when presenting available filter options. When selected the chips updates to show a checkmark icon alongside the label, indicating an active filter.\n    \n*   **Removable** – Used to represent an applied filter. This chip includes a label and a close (×) icon, allowing users to remove the filter with a single click or tap."
    },
    {
      "title": "Example",
      "tag": "H2",
      "section-content": "If a user has accounts in three countries, only those three countries should be shown as filter chips. If they have accounts in just one country, there's no need to show a country filter at all. \n\nTo improve clarity and support informed decisions, display the number of results each selected filter will return. This gives users immediate feedback on how their choices are narrowing or broadening the data set."
    },
    {
      "title": "Sizes",
      "section-content": "The filter chips comes in two sizes:\n\n*   **Large** (default)\n    \n*   **Small**"
    },
    {
      "title": "Do's and don'ts",
      "tag": "H2",
      "cols": "2",
      "columns": [
        {
          "type": "do",
          "dolist": [
            {
              "text": "Use a slide-out modal when there are many filter categories or options."
            },
            {
              "text": "Provide relevant, predefined options to make filtering easier."
            },
            {
              "text": "Allow multiple selections where it makes sense."
            },
            {
              "text": "Make it easy for users to select, unselect, or clear all filters."
            }
          ]
        },
        {
          "type": "dont",
          "dontlist": [
            {
              "text": "Dont' place the filter options directly in the content area if there are too many categories or filters, use a slide-out modal instead."
            }
          ]
        }
      ]
    }
  ],
  "ux-text": [
    {
      "title": "Writing UX text for filter chips",
      "tag": "H2",
      "section-content": "The filter chip text should be short. Use one word, if possible, but no more than three words. Write \"and\" instead of the &-sign, since it's more accessible for the user. Aim at keeping the same text length for all filter chips – but only if it can be done without losing comprehensibility. Only use uppercase in the first word, or if it is the first letter of proper names or abbreviations.\n\nSince chips mainly represent different types of filters, and the filters tell something about the element being filtered, it is usually best to use nouns.\n\n##### **Examples**\n\n*   US-dollar, British Virgin Islands, Normal account, High risk, Global, Emerging markets, Equity funds, Biotechnology\n    \n\nIf you are considering a verb, think about whether it would use buttons for actions or badges for representing e.g. status instead.",
      "cols": "1",
      "columns": [
        {
          "type": "snippet",
          "caption": "Do",
          "plain": false,
          "replay": false,
          "Snippet": "filter-chips-ux-example"
        }
      ]
    },
    {
      "title": "Avoid the & sign",
      "section-content": "Avoid the & sign. Instead, use _and_. Do not start each word with upper case:",
      "cols": "2",
      "columns": [
        {
          "type": "snippet",
          "caption": "Do",
          "plain": false,
          "replay": false,
          "Snippet": "filter-chips-ux-do"
        },
        {
          "type": "snippet",
          "caption": "Don't",
          "plain": false,
          "replay": false,
          "Snippet": "filter-chips-ux-dont"
        }
      ]
    },
    {
      "title": "Do not mix word classes",
      "cols": "2",
      "columns": [
        {
          "type": "snippet",
          "caption": "Do",
          "plain": false,
          "replay": false,
          "Snippet": "filter-chips-ux-classes-do"
        },
        {
          "type": "snippet",
          "plain": false,
          "replay": false,
          "Snippet": "filter-chips-ux-classes-dont"
        }
      ]
    },
    {
      "title": "Do's and don'ts",
      "tag": "H2",
      "cols": "2",
      "columns": [
        {
          "type": "do",
          "dolist": [
            {
              "text": "Use 1–3 words. Preferably, use nouns. Aim for the same text length for all filter chips in the same context."
            }
          ]
        },
        {
          "type": "dont",
          "dontlist": [
            {
              "text": "Avoid the &-sign for and. Do not start each word with upper case. Do not mix word classes."
            }
          ]
        }
      ]
    }
  ]
}