{
  "title": "Table",
  "slug": "table",
  "hero_snippet": "table-hero",
  "beta": true,
  "soon": false,
  "summary": "A table displays structured data for overview and comparison.",
  "anatomy": true,
  "anatomy-list": {
    "anatomyitems": [
      {
        "text": "Header row - Defines and labels each column"
      },
      {
        "text": "Rows - Each row represents a single item or record."
      },
      {
        "text": "Cells - Contain values aligned to the column type."
      },
      {
        "text": "Column label"
      },
      {
        "text": "Sort icon"
      },
      {
        "text": "Table container (card)"
      }
    ]
  },
  "tags": [
    "data"
  ],
  "category": [
    "Components"
  ],
  "platform": {
    "web": true,
    "ios": false,
    "android": false
  },
  "overview": [
    {
      "section-content": "The table component is used to display structured data in rows and columns. It supports overview, comparison and data-driven tasks where users need to scan or interact with multiple items.  \nTables should represent meaningful data relationships and must not be used for layout or visual alignment."
    },
    {
      "title": "Sorting",
      "section-content": "Table header cells can support sorting when enabled. Sorting helps users organise data and compare values within a column.\n\n*   A sorting indicator is shown on hover when sorting is enabled.\n    \n*   Selecting a column header sorts the table by that column.\n    \n*   The sorting indicator remains visible while the column is sorted.\n    \n*   Selecting the same column header again reverses the sort order.\n    \n*   When justified to the right, sorting indicator appears on the left. Column label positioned to the right of the indicator.\n    \n*   Only one column can be sorted at a time.\n    \n\n### Sorting guidelines\n\n*   Enable sorting only when it adds clear value for the user.\n    \n*   Use sorting primarily for columns with comparable values, such as numbers, dates or statuses.\n    \n*   Avoid enabling sorting on columns where order is not meaningful.\n    \n*   Ensure the sorting state is clearly communicated visually.\n    \n\n### Sorting accessibility considerations\n\n*   Sorting must be available using keyboard interaction.\n    \n*   The current sort state should be communicated to assistive technologies.\n    \n*   The sorting indicator should not be the only way to convey sorting state.",
      "cols": "1"
    },
    {
      "title": "Density modes",
      "section-content": "The density property allows customizing the table's visual spacing with these options:\n\n*   **Comfortable** (Default) - Standard spacing for balanced readability\n    \n*   **Compact** - Reduced spacing to maximize information density\n    \n*   **Spacious** - Increased spacing for enhanced readability"
    },
    {
      "title": "Variants",
      "section-content": "The `variant` property controls the visual style of the table container card.\n\nThere are three variants available:\n\n1.  Primary\n    \n2.  Secondary\n    \n3.  Tertiary\n    \n\nNaming will change on the next major release:\n\n*   Primary - Neutral 01\n    \n*   Secondary - Neutral 02\n    \n*   Tertiary - Neutral 02 (Outlined boolean)"
    },
    {
      "title": "Striped",
      "section-content": "When `striped` boolean is set, alternating row background colors are applied to even-numbered rows."
    },
    {
      "title": "Plain",
      "section-content": "When `plain` boolean is set, the table header and footer are removed, rendering only the data table."
    },
    {
      "title": "Interactions",
      "section-content": "Tables may support interaction when it helps users complete their task.  \nSupported behaviours may include:\n\n*   Column sorting\n    \n*   Row selection\n    \n*   Bulk actions\n    \n*   Interactive cells such as links or status indicators\n    \n\nOnly add interaction when it adds clear value and does not reduce clarity."
    },
    {
      "title": "Cell content types",
      "tag": "H2",
      "section-content": "The table supports multiple cell types:\n\n1.  Badge\n    \n2.  Image\n    \n3.  Icon\n    \n4.  Button\n    \n5.  Link\n    \n6.  Context menu\n    \n7.  Formatted text\n    \n    1.  Number\n        \n    2.  Account\n        \n    3.  Date\n        \n\nCell types correspond to their respective Green Design System components and accept their available properties for customization.  \n  \nAny of the cell types can be used on the main value, lead or trail slot.",
      "cols": "1"
    },
    {
      "title": "Actions",
      "section-content": "All the cell content types can be used on actions.\n\nActions accepts an array of cell types such as buttons. When you need to use two buttons align them to the left.\n\nIf you have more than two buttons use the context menu.\n\nActions will always show in the end of the row."
    },
    {
      "title": "Formatting",
      "section-content": "**Column justification**  \nDefault alignment is left (start), with options to justify content to the right (end), and supports space-between layouts.  \nExample: in email columns where cell value and action buttons need clear distinction and consistent alignment across rows.\n\n**Column width and wrapping**  \nColumns can have custom width. When width is set, content will wrap within the cell.\n\n**Cell vertical alignment**  \nCells can be vertically aligned to start (default centered). Recommended to align to start when long or wrapped content is present, ensuring consistent top alignment for labels or values across rows.\n\n**Sortable columns**  \nWhen justified to the right, sorting indicator appears on the left. Column label positioned to the right of the indicator."
    },
    {
      "title": "Responsive",
      "section-content": "When the responsive boolean is set to true, the table transforms its layout for smaller screens, will retain horizontal scroll until that condition is met at smaller than 760px.\n\n*   Rows are restructured into a card-like format\n    \n*   Column names are displayed on the left side\n    \n*   Corresponding cell values are shown on the right side"
    },
    {
      "title": "Slots",
      "section-content": "There are dedicated slots on the header area to slot in other GDS components such as dropdown or button for filtering and exporting data.\n\n> Table has state slots that can be used when there is an error, empty and not search results."
    },
    {
      "title": "Guidelines",
      "section-content": "*   Use clear and descriptive column labels.\n    \n*   Keep the structure predictable and consistent.\n    \n*   Text content should be left-aligned for readability.\n    \n*   Numeric values should be right-aligned, preferably aligned by decimal, to support comparison.\n    \n*   Avoid repeating information in table cells when it can be communicated through the column header.",
      "cols": "1"
    },
    {
      "title": "Do's and Don'ts",
      "cols": "2",
      "columns": [
        {
          "type": "do",
          "dolist": [
            {
              "text": "Use tables for overview and comparison."
            },
            {
              "text": "Keep structure simple and consistent."
            },
            {
              "text": "Use clear and meaningful headers."
            }
          ]
        },
        {
          "type": "dont",
          "dontlist": [
            {
              "text": "Use tables for layout."
            },
            {
              "text": "Place long descriptive text inside cells."
            },
            {
              "text": "Mix unrelated data types in the same column."
            },
            {
              "text": "Add interaction without a clear user need."
            }
          ]
        }
      ]
    }
  ],
  "ux-text": [
    {
      "title": "Writing UX text for table",
      "section-content": "Tables should make information easy to scan, compare and understand at a glance. Good table writing focuses on clarity, consistency and space efficiency.",
      "cols": "1",
      "columns": [
        {
          "type": "rich-text",
          "title": "Keep the column label short and clear",
          "tag": "H3",
          "content": "Use short labels and values. Aim for one or two words in each cell whenever possible. Avoid unnecessary words or repetition. If more explanation is needed, use tooltips."
        },
        {
          "type": "rich-text",
          "title": "Units and symbols",
          "tag": "H4",
          "content": "Do not repeat units or symbols, such as %, kr or EUR, in every cell if the entire column uses the same unit. Instead, include the unit or symbol in the column heading."
        },
        {
          "type": "rich-text",
          "title": "Be careful with capital letters",
          "tag": "H4",
          "content": "Use sentence case in headings and labels. Only capitalise:\n\n*   the first word\n    \n*   proper names\n    \n*   abbreviations."
        },
        {
          "type": "rich-text",
          "title": "Handle empty values clearly",
          "tag": "H3",
          "content": "Don’t leave cells blank. Use an en dash (–) to show that a value is missing or not applicable."
        },
        {
          "type": "rich-text",
          "title": "Align content for readability",
          "tag": "H3",
          "content": "Left-align text and right-align numbers to make scanning easier."
        },
        {
          "type": "rich-text",
          "title": "Error messages or other messages in tables",
          "tag": "H3",
          "content": "Sometimes, error handling is required in tables. Keep messages concise, as space is often limited.\n\n*   Short messages can appear within a table column.\n    \n*   Longer messages should appear in a separate row beneath the relevant data.\n    \n*   Messages may include a link to a help page or another relevant page.  \n    Messages displayed below should be limited to two rows, including any links.\n    \n\nExample: If a mutual fund has been removed from our range, but the customer has not yet updated their default fund distribution, an error message will appear when they try to buy funds according to that distribution or change it.\n\n**Example message:**\n\nIt is no longer possible to trade in this fund. Please change your fund distribution."
        }
      ]
    }
  ],
  "accessibility": [
    {
      "section-content": "*   Use semantic structure so relationships between headers and cells are clear.\n    \n*   Ensure column headers are programmatically associated with their cells.\n    \n*   Provide a clear title or caption describing the purpose of the table.\n    \n*   Ensure the table remains usable on smaller screens;  \n    \\- allow horizontal scrolling when needed  \n    \\- preserve context and readability\n    \n\nIf a table becomes difficult to use on mobile, consider alternative patterns."
    }
  ]
}