{
  "title": "About",
  "slug": "about",
  "summary": "Green Design System is the design system for Skandinaviska Enskilda Banken to make it easier and faster to build beautiful digital products and experiences under the SEB brand.",
  "sections": [
    {
      "max-width": false,
      "cols": "1",
      "columns": [
        {
          "type": "image",
          "src": "/assets/SEB20240905_Seb_innovation_studio_0928_v001.jpg"
        }
      ]
    },
    {
      "title": "What is Green?",
      "tag": "H2",
      "max-width": true,
      "cols": "1",
      "columns": [
        {
          "type": "paragraph",
          "tag": "p",
          "text": "Green Design System is a set of standards to manage design at scale by reducing redundancy while creating a shared language and visual consistency across different pages and channels."
        },
        {
          "type": "paragraph",
          "tag": "p",
          "text": "In order to have velocity when building digital products and keep a cohesive user experience cross channels and platforms designers and developers should use the Green Design System."
        },
        {
          "type": "paragraph",
          "tag": "p",
          "text": "By using pre-built components for design tools and front-end frameworks the time teams spend designing and building is minimized. Instead of spending time on building and re-building the same components in multiple teams, teams can spend that time on addressing specific user needs to improve user experience."
        },
        {
          "type": "paragraph",
          "text": "The design system is called Green as an homage to SEB being viewed as the green bank with green as a primary colour for the brand and the bank. The bank also plays a great role in the transition to anet zero societyand has a focus onsustainabilityand helping it's clients to become more sustainable. The design system initative was also seen as aGreenfieldproject."
        }
      ]
    },
    {
      "title": "How Green works",
      "tag": "H2",
      "max-width": true,
      "cols": "1",
      "columns": [
        {
          "type": "paragraph",
          "tag": "p",
          "text": "The Green Design System is a federated design system where the Green Design System Team is the central team who is dedicated to maintain the design system and other team at SEB or external contributors contribute to the design system with insights, design andcode."
        }
      ]
    },
    {
      "title": "Maintaining and educating",
      "tag": "H2",
      "max-width": true,
      "cols": "1",
      "columns": [
        {
          "type": "paragraph",
          "tag": "p",
          "text": "Navigating the world of Green Design System involves more than just design and code. Delve into our Figma libraries, explore diverse code implementations, and leverage our comprehensive documentation. We're committed to supporting your journey with coaching sessions tailored for both design intricacies and development challenges."
        }
      ]
    },
    {
      "max-width": false,
      "cols": "1",
      "columns": [
        {
          "type": "image",
          "src": "/assets/SEB20241114_11399.jpg"
        }
      ]
    },
    {
      "title": "Built on contributions",
      "tag": "H2",
      "max-width": true,
      "cols": "1",
      "columns": [
        {
          "type": "paragraph",
          "tag": "p",
          "text": "Green Design System is built on contributions from everyone. Product teams at SEB have the best knowledge what their product's end user needs. That's why it's vital that everyone contributes with what's possible. That can be everything from insights regarding a specific component or pull requests with a complete feature or a design updates in a Figma branch."
        }
      ]
    },
    {
      "title": "Contact us",
      "max-width": true,
      "cols": "1",
      "columns": [
        {
          "type": "rich-text",
          "content": "We want to hear from you so don't be a stranger. You can always reach out to us in the following ways:\n\n*   Ask in our [Teams channel](https://teams.microsoft.com/l/team/19%3aR-yrtyItfX3RWEyU8WrCyVy6u-eqWxYPbY1w2O7UVPs1%40thread.tacv2/conversations?groupId=3ad3eb8f-ab23-44e6-9b61-d08fee172513&tenantId=9a8ff9e3-0e35-4620-a724-e9834dc50b51)\n    \n*   Post an [issue on Github](https://seb.io/about)\n    \n*   Email us at [greendesignsystem@seb.se](mailto:greendesignsystem@seb.se)"
        }
      ]
    }
  ]
}