{
  "title": "Alert",
  "slug": "alert",
  "hero_snippet": "hero-alert",
  "beta": true,
  "summary": "An alert displays important messages, feedback, or time-sensitive information.",
  "preamble": "An alert is a message used to inform the user about the state of a system, page, or function. Icons and color indicate the type and urgency of the information within the message.",
  "anatomy": true,
  "anatomy-overview": "Alert consists of a card with an icon, a message text, optional action button, and optional close button. The layout is responsive and adapts based on the size of the Alert.",
  "tags": [
    "Notification",
    "Feedback"
  ],
  "category": [
    "Components"
  ],
  "platform": {
    "web": true,
    "ios": false,
    "android": false
  },
  "overview": [
    {
      "title": "Variants",
      "section-content": "Supports five variants (\\`information\\`, `notice`, `positive`, `warning`, `negative`), each with specific icons and color schemes to convey different types of messages.",
      "cols": "2",
      "columns": [
        {
          "type": "rich-text",
          "title": "Information",
          "tag": "H3",
          "content": "Shares non-urgent updates, like new features or tips, with a brief message and optional next steps."
        },
        {
          "type": "snippet",
          "caption": "Alert variant information",
          "Snippet": "alert-information"
        },
        {
          "type": "rich-text",
          "title": "Notice",
          "tag": "H3",
          "content": "Conveys general announcements or non-critical updates, like service changes, with a short description and optional guidance."
        },
        {
          "type": "snippet",
          "caption": "Alert variant notice",
          "Snippet": "alert-notice"
        },
        {
          "type": "rich-text",
          "title": "Positive",
          "tag": "H3",
          "content": "Confirms successful actions, like form submissions, with a success message, optional next steps, and possible brand reinforcement."
        },
        {
          "type": "snippet",
          "caption": "Alert variant positive",
          "Snippet": "alert-positive"
        },
        {
          "type": "rich-text",
          "title": "Warning",
          "tag": "H3",
          "content": "Highlights non-critical issues, like upcoming deadlines, with a concise issue summary, optional duration estimate, and suggested actions."
        },
        {
          "type": "snippet",
          "caption": "Alert variant warning",
          "Snippet": "alert-warning"
        },
        {
          "type": "rich-text",
          "title": "Negative",
          "tag": "H3",
          "content": "Communicates critical issues or errors, like system outages, with a clear problem description, optional apology for system issues, and resolution guidance."
        },
        {
          "type": "snippet",
          "caption": "Alert variant negative",
          "Snippet": "alert-negative"
        }
      ]
    },
    {
      "title": "Action button",
      "tag": "H3",
      "section-content": "The Alert supports an optional action button with customizable text to trigger relevant actions."
    },
    {
      "title": "Dismissibility",
      "tag": "H3",
      "section-content": "The Alert can be configured as `dismissible` in order to show a close button in the upper right corner. This also enabled closing the Alert by pressing the Escape key.\n\n#### Auto-dismiss\n\nThe Alert can also be set up to use an auto-dismiss timer. In this configuration, a timer progress bar will be shown at the bottom of the Alert, and the Alert will close once the timer reaches the end."
    },
    {
      "title": "Guidelines",
      "section-content": "Select the appropriate variant to match the message’s intent, such as using positive for success messages or negative for errors. Also ensure a meaningful label property is set to describe the alert’s purpose for accessibility. A label should alwys be set when using Alert.\n\nChoose the role property carefully, using alert for critical messages and status for informational updates, to align with ARIA best practices.\n\nFor toast-like messages, like save confirmations and other non-critical messages, auto-dismiss can be used to avoid interrupting user workflows.",
      "cols": "1",
      "columns": [
        {
          "type": "rich-text",
          "title": "Do",
          "content": "*   Use concise, clear message text to ensure quick comprehension.\n    \n*   Enable `dismissible` for alerts, unless you need them to stay on screen permanently."
        },
        {
          "type": "rich-text",
          "title": "Dont",
          "content": "*   Don’t use overly long message text.\n    \n*   Avoid using `alert` role for non-critical messages; use `status` instead to reduce urgency.\n    \n*   Don’t set a timeout for critical alerts that require user acknowledgment.\n    \n*   Never omit the label property, as it’s essential for screen reader users.\n    \n*   Don’t use vague `button-label` text like “Click Here”; be specific about the action."
        }
      ]
    }
  ]
}