{
  "title": "Badge",
  "slug": "badge",
  "hero_snippet": "hero-badge",
  "beta": true,
  "summary": "A compact visual indicator for status, counts and notifications.",
  "preamble": "A badge is a compact visual indicator that helps highlight status, categorize content, or display notifications. It can be different variants and sizes to effectively communicate meaning. Badges help users quickly understand the state or related elements in the interface.",
  "anatomy": true,
  "anatomy-details": "1.  Container\n    \n2.  Icon\n    \n3.  Status text",
  "tags": [
    "Status",
    "notification"
  ],
  "platform": {
    "web": true,
    "ios": false,
    "android": false
  },
  "overview": [
    {
      "title": "Usage",
      "tag": "H2",
      "section-content": "Badges are especially useful for:\n\n*   **Status indicators** – Showing that something is new, in progress, needs attention, or has been successfully completed.\n    \n*   **Counters** – Indicating the number of new messages, notifications, or tasks.\n    \n*   **Contextual highlights** – Marking a feature as beta, or signaling updates users should be aware of.\n    \n\nUse badges sparingly—too many can create visual noise and reduce their impact. Always ensure that the badge color and label clearly support the intended message."
    },
    {
      "title": "Variants",
      "section-content": "A set of predefined styles (information, notice, positive, warning, negative) that convey different meanings and states through consistent visual treatment. Choose the badge variant based on the tone and urgency of the message:\n\n*   **Positive** – For confirming success or a completed action (e.g., “Active” or “Paid”).\n    \n*   **Negative** – For errors, failed states, or items requiring immediate attention.\n    \n*   **Notice** – For neutral alerts or flags that are not critical but still relevant.\n    \n*   **Warning** – For potential issues users should be cautious about.\n    \n*   **Information** – For general updates or tips that help the user understand context.",
      "cols": "1",
      "columns": [
        {
          "type": "snippet",
          "caption": "All badge variants",
          "plain": false,
          "Snippet": "badge-variants"
        }
      ]
    },
    {
      "title": "Size",
      "section-content": "Available in 'default' and 'small' sizes to accommodate different UI contexts and content requirements.",
      "cols": "1",
      "columns": [
        {
          "type": "snippet",
          "caption": "Default(large) and small badge size",
          "plain": false,
          "Snippet": "badge-size"
        }
      ]
    },
    {
      "title": "Notification Mode",
      "section-content": "Specialized display mode optimized for notification indicators with rounded styling.",
      "cols": "1",
      "columns": [
        {
          "type": "snippet",
          "caption": "Badge notification mode.",
          "plain": false,
          "Snippet": "badge-notification"
        }
      ]
    },
    {
      "title": "Rounded",
      "section-content": "The rounded property transforms the badge's appearance by applying fully circular corners, making it ideal for numerical indicators or status markers where a softer, pill-shaped design is desired. This styling variation maintains the badge's core functionality while offering an alternative visual treatment that can better suit certain interface contexts, particularly when used with single or double-digit numbers.",
      "cols": "1",
      "columns": [
        {
          "type": "snippet",
          "caption": "Rounded badge.",
          "plain": false,
          "Snippet": "badge-rounded"
        }
      ]
    },
    {
      "title": "Lead and trail",
      "section-content": "The badge component supports both lead and trail slots, enabling the placement of icons or additional content before or after the main text. These slots enhance the badge's versatility, allowing for combinations like status indicators with icons or interactive badges with trailing actions.",
      "cols": "2",
      "columns": [
        {
          "type": "snippet",
          "caption": "Badge with lead icon",
          "plain": false,
          "Snippet": "badge-lead"
        },
        {
          "type": "snippet",
          "caption": "Badge with trail content",
          "plain": false,
          "Snippet": "badge-trail"
        }
      ]
    }
  ]
}