{
  "title": "Breadcrumbs",
  "slug": "breadcrumbs",
  "hero_snippet": "hero-breadcrumb",
  "beta": true,
  "summary": "A breadcrumb is a secondary navigation showing the website hierarchy.",
  "preamble": "We use breadcrumbs to display site hierarchy (rather than navigation path) and to increase findability of parent pages.\n\nBreadcrumbs help users navigate upward in the hierarchy and typically help with back-movement also. They also help with context when navigation is otherwise out of sight (for example in a mobile view).\n\nBreadcrumbs have been proven to reduce bounce rates for search-users, when they are able to quickly find related pages.",
  "anatomy": true,
  "anatomy-list": {
    "anatomyitems": [
      {
        "text": "Link"
      },
      {
        "text": "Link divider"
      },
      {
        "text": "Current page"
      },
      {
        "text": "Overflow icon button"
      }
    ]
  },
  "tags": [
    "navigation"
  ],
  "category": [
    "Components"
  ],
  "platform": {
    "web": true,
    "ios": false,
    "android": false
  },
  "overview": [
    {
      "title": "When to use it",
      "section-content": "Use for sites/applications that have a substantial amount of pages present deeper down in site structures."
    },
    {
      "title": "Desktop",
      "section-content": "The full path may not take up more than one row in the layout.",
      "cols": "1",
      "columns": [
        {
          "type": "snippet",
          "caption": "Breadcrumb in desktop",
          "plain": false,
          "Snippet": "hero-breadcrumb"
        }
      ]
    },
    {
      "title": "Mobile",
      "section-content": "For mobile views we only display the link to the parent page, as the full path tends to take too much space.\n\nThe same version may be used in shallow hierarchies where there still is a need to easily move one step up, or back to the page from where you came.",
      "cols": "1",
      "columns": [
        {
          "type": "snippet",
          "caption": "Simplified breadcrumbs",
          "plain": false,
          "Snippet": "breadcrumbs-mobile"
        }
      ]
    },
    {
      "title": "Overflow",
      "section-content": "The breadcrumbs component is designed with flexibility in mind, allowing developers to implement \\* custom overflow solutions that best fit their specific needs.",
      "cols": "1",
      "columns": [
        {
          "type": "snippet",
          "caption": "Breadcrumbs with custom overflow",
          "plain": false,
          "Snippet": "breadcrumbs-overflow"
        }
      ]
    }
  ],
  "ux-text": [
    {
      "title": "desktop",
      "section-content": "The breadcrumb should be the same as the heading, or if lacking of heading the menu title, on the page it represent. The last breadcrumb is the page you are currently on. If the heading is very long and we have decided to make it shorter in the menu title then use the menu title as the breadcrumb title."
    },
    {
      "title": "Breadcrumb Guidelines",
      "section-content": "Default breadcrumbs on desktop\n\n*   The breadcrumb should match the page's heading.\n    \n*   If there is no heading, use the menu title.\n    \n*   The last breadcrumb represents the current page.\n    \n*   If the heading is very long and shortened in the menu title, use the menu title as the breadcrumb."
    },
    {
      "title": "Web page mobile",
      "section-content": "In mobile views, only the previous page's heading is displayed as the breadcrumb."
    },
    {
      "title": "The apps (native)",
      "section-content": "In our apps, we have the same pattern for breadcrumbs as for the mobile view. But, since each page typically features a navbar with a title there may not be enough space for a long text like the previous heading. In such cases, use \"Back\" instead. If there is no room for even the word \"Back,\" display only the back arrow. Ensure that TalkBack/VoiceOver reads the previous page's title for accessibility."
    }
  ],
  "accessibility": [
    {
      "section-content": "All values we measure need to pass in order to give a check on the accessibility on all our components."
    },
    {
      "title": "Important considerations",
      "tag": "H2",
      "cols": "1",
      "columns": [
        {
          "type": "rich-text",
          "title": "Keyboard navigation",
          "tag": "H3",
          "content": "Uses default navigation: Tabs as normal and trigger on key-down with enter."
        },
        {
          "type": "rich-text",
          "title": "Animation",
          "tag": "H3",
          "content": "Hopefully in future it will be possible to turn of the animation by a user setting."
        }
      ]
    }
  ]
}