{
  "title": "Button",
  "slug": "button",
  "hero_snippet": "hero-button",
  "beta": true,
  "summary": "A button can be tapped or clicked to perform an action.",
  "preamble": "A button serve as an interactive element that enables users to perform an action or make a choice with a simple click or tap. To decide which kind of button/buttons and putting them in the right order is key to make sure users know how to take the right action. A good rule of thumb is to use only one primary action in each context.",
  "anatomy": true,
  "tags": [
    "Form",
    "action",
    "button"
  ],
  "category": [
    "Components"
  ],
  "platform": {
    "web": true,
    "ios": true,
    "android": true
  },
  "overview": [
    {
      "title": "Buttons",
      "tag": "H2",
      "cols": "3",
      "columns": [
        {
          "type": "figma",
          "caption": "Default button",
          "node": "default-button"
        },
        {
          "type": "figma",
          "caption": "Icon button",
          "node": "icon-button"
        },
        {
          "type": "figma",
          "caption": "Floating action button",
          "node": "fab-button"
        },
        {
          "type": "figma",
          "caption": "Split button",
          "node": "split-button"
        },
        {
          "type": "figma",
          "caption": "Next and back button",
          "node": "next-back-button"
        }
      ]
    },
    {
      "title": "Default button",
      "tag": "H2",
      "section-content": "The default button is our most used button. It comes in primary, secondary and tertiary, and the sizes small, medium and large.\n\nThe default button can be used as the positive, negative and inverted type.",
      "cols": "2",
      "columns": [
        {
          "type": "figma",
          "caption": "Primary, secondary and tertiary",
          "node": "default-prio"
        },
        {
          "type": "figma",
          "caption": "Positive and negative",
          "node": "default-pos-neg"
        }
      ]
    },
    {
      "title": "Icon button",
      "tag": "H2",
      "section-content": "When there is space, the icon button should always be grouped with a text label. This text provides additional context for users who may not understand the icon alone. If space is not available the icon need to be self explanatory, and have a tooltip function explaining the action.\n\nThe icon button comes in primary, secondary, and tertiary. In the sizes small, medium, and large. The icon button also comes as a tonal in two sets. One tonal in grey, used mostly on our container colour. And a few custom tonal combinations, used on custom combination cards. For example our alert ribbons.\n\nThe icon button can be used as the positive, negative and inverted type also when the context needs it.",
      "cols": "2",
      "columns": [
        {
          "type": "figma",
          "caption": "Icon button – default and positive",
          "node": "icon-button"
        },
        {
          "type": "figma",
          "caption": "Tonal and custom tonal",
          "node": "icon-button-custom"
        }
      ]
    },
    {
      "title": "Floating action button",
      "section-content": "Only used for functions central to the user experience, such as support and help features that needs to be accessible at all times.\n\nThe button is always floating visible in the users viewport, typically in the lower right corner. This button can be used with an icon only.\n\nUsed only as primary.",
      "cols": "2",
      "columns": [
        {
          "type": "figma",
          "caption": "Floating action button",
          "node": "fab"
        }
      ]
    },
    {
      "title": "Split button",
      "section-content": "The split button always has a primary action. This action is most likely to be used by the customer as the default action.When users click on the primary action, it triggers this action directly, such as submitting a form, confirming a selection, or initiating a process.\n\nThe users can click on the dropdown arrow to reveal a dropdown menu providing secondary or additional options.\n\nThe split button comes in both primary and secondary.",
      "cols": "2",
      "columns": [
        {
          "type": "figma",
          "caption": "Split button – primary and secondary",
          "node": "split-1"
        },
        {
          "type": "figma",
          "caption": "Split button – active with dropdown",
          "node": "split-2"
        }
      ]
    },
    {
      "title": "Next and back button",
      "section-content": "Used inside flows to signal the direction forward or backward.\n\nBack button comes in both primary and secondary state depending on what suits the content. The next button comes as primary only.",
      "cols": "3",
      "columns": [
        {
          "type": "figma",
          "caption": "Next button",
          "node": "next"
        },
        {
          "type": "figma",
          "caption": "Back button – primary",
          "node": "back-1"
        },
        {
          "type": "figma",
          "caption": "Back button – secondary",
          "node": "back-2"
        }
      ]
    },
    {
      "title": "Variants",
      "section-content": "*   **Default**: The preferred choice of button in most contexts.\n    \n*   **Positive**: To be decided.\n    \n*   **Negative**: Use for the actions that may be harmful or destructive. A good example is deleting.\n    \n*   **Tonal**: Only used internal in other components (to match a background).\n    \n*   **Inverted**: Used to place on other than the normal backgrounds (typically darker tones).",
      "cols": "1",
      "columns": [
        {
          "type": "figma",
          "caption": "Button variants",
          "node": "variants"
        }
      ]
    },
    {
      "title": "Hierarchy",
      "section-content": "It's critical to find the right balance of what buttons to use. It's up to us as designers to guide and inform the users to take the right action.\n\n*   **Primary buttons** require the most attention from your users.\n    \n*   **Secondary buttons**, as the name says, is the second most likely choice.\n    \n*   **Tertiary buttons** are used for less used or unwanted actions that is still relevant to find.",
      "cols": "2",
      "columns": [
        {
          "type": "figma",
          "caption": "From the top – primary, secondary, tertiary",
          "node": "hierarchy"
        }
      ]
    },
    {
      "title": "Button sizes",
      "section-content": "The default button and icon button comes in a few different sizes. 32, 40 and 48 px.",
      "cols": "3",
      "columns": [
        {
          "type": "figma",
          "caption": "Small – used in confined spaces, like tables.",
          "node": "small"
        },
        {
          "type": "figma",
          "caption": "Medium – the default size. When in doubt, go for medium.",
          "node": "medium"
        },
        {
          "type": "figma",
          "caption": "Large – only used in large areas like a hero.",
          "node": "large"
        }
      ]
    },
    {
      "title": "Desktop placements",
      "section-content": "*   **Left**: In overviews and widgets, the user tends to read from top to bottom, therefore the buttons are kept to the left.\n    \n*   **Right**: Modals and flows move the user from left to right, therefore the buttons are placed to the right.",
      "cols": "2",
      "columns": [
        {
          "type": "figma",
          "caption": "Placement left",
          "node": "placement-desktop-1"
        },
        {
          "type": "figma",
          "caption": "Placement",
          "node": "placement-desktop-2"
        }
      ]
    },
    {
      "title": "In a mobile device",
      "section-content": "*   **One button**, use the full width of the content area.\n    \n*   **Two buttons**, aim to place them side by side. It is allowed to stack them if needed.\n    \n*   **Three buttons**, consider the need for all of them. \"cancel or close\" might be x in the top right corner. Worst case scenario: place two buttons side by side and one tertiary button under.",
      "cols": "2",
      "columns": [
        {
          "type": "figma",
          "caption": "One button in mobile",
          "node": "placement-mobile-1"
        },
        {
          "type": "figma",
          "caption": "Side by side in mobile",
          "node": "placement-mobile-2"
        }
      ]
    },
    {
      "title": "Do’s and don’ts",
      "section-content": "Only use one primary action in the same context of several actions.",
      "cols": "2",
      "columns": [
        {
          "type": "figma",
          "node": "do"
        },
        {
          "type": "figma",
          "node": "dont"
        }
      ]
    }
  ],
  "ux-text": [
    {
      "cols": "1",
      "columns": [
        {
          "type": "paragraph",
          "text": "The button text should answer the question \"What is happening?\" when the user clicks it, but if the purpose of the button is to convert, it should answer the question \"What do I get?\"."
        }
      ]
    },
    {
      "title": "Use commands and requests in the button",
      "tag": "H3",
      "cols": "1",
      "columns": [
        {
          "type": "rich-text",
          "content": "You should primarily use verbs in the imperative mood, which is the form of the verb that conveys commands or requests, for example, Order, Apply, Submit and Sign. If needed, you can add what happens, for example, Write a new message or Add a row. In special cases, the button may consist of another type of text, for example, This solution suits me."
        }
      ]
    },
    {
      "title": "Avoid Perform and Okay",
      "tag": "H3",
      "cols": "1",
      "columns": [
        {
          "type": "rich-text",
          "content": "Avoid using words like Perform (Utför) and Okay (Okej) in buttons. Perform is too formal and Okay is too vague and doesn’t answer the question “What is happening?” when the user clicks the button."
        }
      ]
    },
    {
      "title": "Standard button texts",
      "tag": "H3",
      "cols": "1",
      "columns": [
        {
          "type": "rich-text",
          "content": "Standard text for our most commonly used buttons."
        }
      ]
    },
    {
      "cols": "3",
      "columns": [
        {
          "type": "image",
          "caption": "Next (Nästa)",
          "src": "/assets/metallic-surface.jpg"
        },
        {
          "type": "image",
          "caption": "Back (Tillbaka)",
          "src": "/assets/metallic-surface.jpg"
        },
        {
          "type": "image",
          "caption": "Cancel (Avbryt)",
          "src": "/assets/metallic-surface.jpg"
        }
      ]
    },
    {
      "cols": "2",
      "columns": [
        {
          "type": "rich-text",
          "title": "Cancel and close",
          "tag": "H2",
          "content": "It is important to avoid confusion for the user which button to click. The combination Cancel and Close is very similar. Instead, use Back as the secondary action when primary action is Cancel."
        },
        {
          "type": "image",
          "src": "/assets/metallic-surface.jpg"
        }
      ]
    },
    {
      "title": "Do’s and don’ts",
      "tag": "H2",
      "cols": "2",
      "columns": [
        {
          "type": "rich-text",
          "title": "Do",
          "tag": "H3",
          "content": "*   Answer the question “What is happening?” or “What do I get?”.\n    \n*   Use commands or requests in the button.\n    \n*   Use Back as secondary action in modals where primary actions is Cancel."
        },
        {
          "type": "rich-text",
          "title": "Don’t",
          "tag": "H3",
          "content": "*   Avoid the formal Perform (Utför) and the vague Okay (Okej).\n    \n*   Do not use primary and secondary button text that is too similar to each other."
        }
      ]
    }
  ],
  "accessibility": [
    {
      "cols": "1",
      "columns": [
        {
          "type": "rich-text",
          "content": "All values we measure need to pass in order to give a check on the accessibility on all our components."
        }
      ]
    },
    {
      "title": "Important considerations",
      "tag": "H2",
      "cols": "1",
      "columns": [
        {
          "type": "rich-text",
          "title": "Maintain semantic consistency",
          "tag": "H3",
          "content": "Do not use links ('a' tag) instead of buttons ('button' tag). Buttons are intended for actions or operations (e.g. submitting forms, triggering actions), while links are intended for navigation to other pages or resources. Avoid using links for triggering actions, or buttons for navigation purposes."
        }
      ]
    },
    {
      "title": "Keyboard navigation",
      "tag": "H2",
      "cols": "1",
      "columns": [
        {
          "type": "rich-text",
          "content": "Uses default navigation: Tabs as normal and trigger on key-up with space and on key-down with enter."
        }
      ]
    },
    {
      "title": "Labelling",
      "tag": "H2",
      "cols": "1",
      "columns": [
        {
          "type": "rich-text",
          "content": "*   Ensure buttons have discernible label text. If the button has no visible text, the label attribute must be used to provide an accessible label.\n    \n*   If there are multiple buttons with the same text, such as Apply, the label attribute can be used to give each button a distinct label, such as Apply for A, Apply for B, etc."
        }
      ]
    },
    {
      "cols": "2",
      "columns": [
        {
          "type": "image",
          "caption": "Buttons with accessible labels.",
          "src": "/assets/metallic-surface.jpg"
        },
        {
          "type": "image",
          "caption": "Icon buttons with accessible labels, label attributes.",
          "src": "/assets/metallic-surface.jpg"
        }
      ]
    }
  ]
}