{
  "title": "Card",
  "slug": "card",
  "hero_snippet": "hero-card",
  "beta": false,
  "soon": false,
  "summary": "The card groups related content into a single container.",
  "preamble": "The card is a container component used to group related content and actions. It serves as the foundation for our card patterns. Card can contain multiple interactive elements (buttons and links) or be configured as a single interactive element (a linked card).",
  "anatomy": true,
  "anatomy-list": {
    "anatomyitems": [
      {
        "text": "Container"
      },
      {
        "text": "Outline"
      },
      {
        "text": "Slot"
      }
    ]
  },
  "category": [
    "Layout"
  ],
  "platform": {
    "web": true,
    "ios": false,
    "android": false
  },
  "overview": [
    {
      "title": "Variants",
      "cols": "3",
      "columns": [
        {
          "type": "snippet",
          "caption": "Neutral 01 (grey)\t- default choice for use on white backgrounds.",
          "plain": false,
          "replay": false,
          "Snippet": "card-neutral-01"
        },
        {
          "type": "snippet",
          "caption": "Neutral 02 (white) - use on darker or grey backgrounds.",
          "plain": false,
          "replay": false,
          "Snippet": "card-neutral-02"
        },
        {
          "type": "snippet",
          "caption": "Neutral 02 outlined",
          "plain": false,
          "replay": false,
          "Snippet": "card-neutral-02-outlined"
        }
      ]
    },
    {
      "title": "Interactions",
      "cols": "2",
      "columns": [
        {
          "type": "rich-text",
          "title": "Default",
          "tag": "H3",
          "content": "The entire card area is not clickable. The slotted content can contain one or several clickable elements, such as button and link."
        },
        {
          "type": "snippet",
          "plain": false,
          "replay": false,
          "Snippet": "card-interaction-default"
        },
        {
          "type": "rich-text",
          "title": "Linked",
          "content": "The entire card area is clickable. The slotted content can include one decorative element. This element must be inert (non-interactive) since the whole card already functions as the clickable target."
        },
        {
          "type": "snippet",
          "plain": false,
          "replay": false,
          "Snippet": "card-interaction-linked"
        }
      ]
    },
    {
      "title": "Usage",
      "section-content": "Do not mix linked and default cards in the same group or grid.  \nInteractions should be consistent across a set of cards to ensure a predictable and accessible experience. If you must use both in the same view, do it with care, for example, by visually separating them or clearly communicating the interaction difference.",
      "cols": "1",
      "columns": [
        {
          "type": "rich-text",
          "title": "Why this matters",
          "tag": "H3",
          "content": "*   **Consistency** - users should understand how a card behaves before they interact with it. Mixing types can make it unclear whether the whole card or only parts are clickable.\n    \n*   **Accessibility** - linked cards rely on different interaction logic and focus handling compared to cards with multiple actions. Mixing them can create confusion for keyboard and screen-reader users.\n    \n*   **Visual clarity** - linked cards use hover and press states that don’t apply to default cards, which can create inconsistent visual feedback."
        }
      ]
    },
    {
      "title": "Do's and don'ts",
      "cols": "2",
      "columns": [
        {
          "type": "do",
          "dolist": [
            {
              "text": "Maintain consistency: Follow the design system’s guidelines for typography, spacing, colors, and borders to ensure cards look cohesive across the application."
            }
          ]
        },
        {
          "type": "dont",
          "dontlist": [
            {
              "text": "Overload content: Avoid cramming too much information into a single card."
            },
            {
              "text": "Overuse cards: Avoid using cards for every piece of content; reserve them for scenarios where grouped, modular content makes sense."
            },
            {
              "text": "Make cards interactive: use interactive elements, such as buttons or links, within the card instead."
            }
          ]
        }
      ]
    }
  ]
}