{
  "title": "Datepicker",
  "slug": "datepicker",
  "hero_snippet": "hero-datepicker",
  "beta": false,
  "summary": "⁠The datepicker allows users to select a date.",
  "preamble": "Datepickers are used to enter a date. The user can enter the date as numbers using three predefined spinner inputs (year, month, day), or select a date from the calendar popover.\n\nDatepickers helps users avoid formatting errors and makes date entry accessible to assistive technologies.",
  "anatomy": true,
  "anatomy-overview": "The datepicker consists of an input field with some additional controls to help users select a well-formed date. First, there are three [spinbuttons](https://developer.mozilla.org/en-US/docs/Web/Accessibility/ARIA/Reference/Roles/spinbutton_role), representing day, month and year. These can be configured in any order and with different separators to accommodate different date formats. Second, there is a calendar button, which when activated opens a calendar popover. The calendar popover helps users to visually browse and select a date.",
  "anatomy-list": {
    "anatomyitems": [
      {
        "text": "Label"
      },
      {
        "text": "Input container"
      },
      {
        "text": "Spinbutton"
      },
      {
        "text": "Trailing icon button"
      }
    ]
  },
  "tags": [
    "date",
    "date-range",
    "form",
    "time"
  ],
  "category": [
    "Components"
  ],
  "platform": {
    "web": true,
    "ios": false,
    "android": false
  },
  "compare": "Calendar",
  "overview": [
    {
      "title": "Features",
      "tag": "H2",
      "section-content": "*   Configurable date format display\n    \n*   `plain` mode to hide labels and error messages\n    \n*   Clearable for quick state reset\n    \n*   Min and max dates\n    \n*   Can be configured with visible or hidden week numbers\n    \n*   Individual dates can be marked as disabled in the calendar\n    \n*   Buttons in the calendar footer are configurable",
      "cols": "1"
    },
    {
      "title": "Usage",
      "tag": "H2",
      "section-content": "Use datepicker when a complete date should be entered.",
      "cols": "1"
    },
    {
      "title": "Size",
      "tag": "H2",
      "section-content": "The datepicker comes in two sizes.\n\n*   **Large**\n    \n*   **Small**: used in tables and in some special cases where the space is very limited."
    },
    {
      "title": "Do's and don'ts",
      "cols": "2",
      "columns": [
        {
          "type": "do",
          "dolist": [
            {
              "text": "Use datepicker when users need to be able to input data other than well-formed dates."
            },
            {
              "text": "If only a year, a month, a day, or a combination of two, is needed, use separate input fields or dropdowns. For example, a credit card expiry month."
            }
          ]
        },
        {
          "type": "dont",
          "dontlist": [
            {
              "text": "Use only a datepicker alone when user needs to be able to specify a time. An additional input for time is needed in that case."
            },
            {
              "text": "Write out the format in the label. The datepicker is already constrained to a configured format."
            }
          ]
        }
      ]
    }
  ]
}