{
  "title": "Dialog",
  "slug": "dialog",
  "hero_snippet": "hero-dialog",
  "beta": true,
  "soon": false,
  "summary": "⁠A dialog appears in front of content to provide critical information or ask for a decision.",
  "preamble": "Dialogs are used to provide the user with a focused interface for specific tasks or information, appearing as a temporary window that requires user interaction before returning to the main application.",
  "anatomy": true,
  "anatomy-overview": "Dialogs consists of a floating card featuring a drop shadow and with a backdrop behind it. The card has a header with title and close button, a slot for body content and a slot for footer buttons at the bottom. If no footer buttons are provided, a default set of buttons are rendered.",
  "anatomy-list": {
    "anatomyitems": [
      {
        "text": "Heading"
      },
      {
        "text": "Text"
      },
      {
        "text": "Primary action"
      },
      {
        "text": "Secondary action"
      },
      {
        "text": "Dismiss icon button"
      },
      {
        "text": "Container"
      }
    ]
  },
  "tags": [
    "modal",
    "Dialog",
    "slide-out"
  ],
  "category": [
    "Components"
  ],
  "platform": {
    "web": true,
    "ios": false,
    "android": false
  },
  "overview": [
    {
      "title": "Features",
      "tag": "H2",
      "cols": "1",
      "columns": [
        {
          "type": "rich-text",
          "content": "Dialogs are modal, meaning they block interaction with the rest of the application or interface until the user addresses the dialog (e.g., by clicking a button, entering input, or closing it). This ensures the user focuses on the dialog's content before returning to the main workflow, and also ensures that keyboard and screen reader focus is kept within the dialog.\n\nBy default, the dialog will close when the user clicks the backdrop, but this behavior can be opted out from if the dialog needs to stay open until a flow is completed, for example."
        }
      ]
    },
    {
      "title": "Variants",
      "section-content": "The dialog can be shown either as a regular dialog window or as a slide-out.",
      "cols": "2",
      "columns": [
        {
          "type": "rich-text",
          "title": "Regular",
          "tag": "H3",
          "content": "The regular window is positioned in the center of the screen."
        },
        {
          "type": "snippet",
          "plain": false,
          "replay": false,
          "Snippet": "dialog-regular"
        },
        {
          "type": "rich-text",
          "title": "Slide-out",
          "content": "The slide-out is positioned on the right-hand side and always takes up the full height of the viewport (minus padding). Height and width can be customized to suite various needs."
        },
        {
          "type": "snippet",
          "plain": false,
          "replay": false,
          "Snippet": "dialog-slideout"
        }
      ]
    },
    {
      "title": "Usage",
      "section-content": "Dialogs are powerful tools for focusing user attention, but their use should be deliberate to avoid disrupting the user experience."
    },
    {
      "title": "Do's and don'ts",
      "cols": "2",
      "columns": [
        {
          "type": "do",
          "dolist": [
            {
              "text": "Use dialogs for critical actions, such as confirming a deletion or agreeing to terms."
            },
            {
              "text": "Use dialogs for multi-step processes, like a setup wizard or onboarding flow."
            },
            {
              "text": "Use dialogs for short, specific input tasks, like entering a file name, setting preferences, or filling out a quick form."
            },
            {
              "text": "Use button ranks to make the primary action obvious. For example, use the primary button for “Save” and secondary for “Cancel”"
            },
            {
              "text": "Ensure the dialog relates to the user’s current task. Include relevant information, like the name of the item being deleted."
            }
          ]
        },
        {
          "type": "dont",
          "dontlist": [
            {
              "text": "Don’t use dialogs for trivial confirmations or information that could be displayed inline."
            },
            {
              "text": "Don’t use dialogs for extensive forms or complex tasks that require significant screen space or navigation."
            },
            {
              "text": "Avoid dialogs for repetitive tasks, as they slow users down."
            }
          ]
        }
      ]
    }
  ],
  "ux-text": [
    {
      "title": "Writing UX text for dialogs",
      "tag": "H2",
      "section-content": "Dialogs are often used to confirm actions that could have negative consequences. To keep them clear and helpful:\n\n*   Use a clear title that states what will happen next.\n    \n*   Explain the action and its consequences in the message.\n    \n*   You may highlight one key sentence, but don’t overuse emphasis – and avoid using \"please\".\n    \n*   The title should match the primary button or at least contain the most important keyword. Avoid vague options like ”I understand”or ”OK”.\n    \n*   It’s fine to use ”Yes” or ”No”, but not both together. Always include another option that clearly reflects the action or matches the title. Example: Yes, cancel.\n    \n*   Make sure the primary and secondary buttons are clearly different. The user shouldn’t have to think twice.\n    \n*   Use ”Back” instead of ”Close” if the primary action is something similar, like ”Cancel” ([read more in the guidelines for buttons](https://seb.io/component/button)).\n    \n*   Repeat the user’s original action in the primary button, even if you’d prefer them to choose something else – it's the action they took, intentionally or not.\n    \n\n(Add example do example from design library, don't example needs to be changed to a do: Cancel the application and new buttons Back and Yes, cancel)",
      "cols": "3",
      "columns": [
        {
          "type": "snippet",
          "caption": "Do",
          "plain": false,
          "replay": false,
          "Snippet": "dialog-ux-do"
        },
        {
          "type": "snippet",
          "caption": "Do",
          "plain": false,
          "replay": false
        },
        {
          "type": "snippet",
          "caption": "Don't",
          "plain": false,
          "replay": false,
          "Snippet": "dialog-ux-dont"
        }
      ]
    }
  ]
}