{
  "title": "Form summary",
  "slug": "form-summary",
  "hero_snippet": "hero-form-summary",
  "beta": true,
  "summary": "Form summary shows all form errors in one place.",
  "preamble": "Form summary assists users in identifying and addressing multiple errors in one place.\n",
  "anatomy": true,
  "anatomy-overview": "The form summary consists of a card with a heading outlining the number of errors currently in the form, followed by a list of the errors. Each error has an icon button with an arrow pointing in the direction of the associated control. Clicking one of the errors moves focus to the associated form control.",
  "anatomy-list": {
    "anatomyitems": [
      {
        "text": "Card"
      },
      {
        "text": "Heading with amount of errors"
      },
      {
        "text": "Error item"
      },
      {
        "text": "Icon button"
      }
    ]
  },
  "tags": [
    "form"
  ],
  "category": [
    "Components"
  ],
  "platform": {
    "web": true,
    "ios": false,
    "android": false
  },
  "overview": [
    {
      "title": "Features",
      "tag": "H2",
      "cols": "1",
      "columns": [
        {
          "type": "rich-text",
          "content": "Form summary works automatically when placed in a form with form controls from Green Core. It has two update modes, `default` and `reactive`. In the default mode, a `refresh()` method needs to be called for the component to update and reflect the current state of the form. In the `reactive` mode, it will update on the fly as soon as the status of a control in the form changes. The `reactive` mode requires less setup to use, but the `default` mode allows for more control over the behavior."
        }
      ]
    },
    {
      "cols": "2",
      "columns": [
        {
          "type": "rich-text",
          "title": "Accessibility",
          "tag": "H3",
          "content": "Semantically, the form summary is represented as a navigation region containing an unordered list of links."
        },
        {
          "type": "rich-text",
          "title": "Compatibility",
          "tag": "H3",
          "content": "Form summary is mainly intended for use with form controls from Green Core, but it also works with generic native form controls by using data-attributes."
        }
      ]
    },
    {
      "title": "Usage",
      "cols": "1",
      "columns": [
        {
          "type": "rich-text",
          "content": "For long forms which are dynamically submitted (meaning the page does not reload), place the form summary at the bottom of the form, close to the submit button, so that it appears in view for the user without scrolling.\n\nFor long forms which are server-side driven (page reloads when submitting), place the form summary at the top so that it will be the first thing the user sees when the page reloads.\n\nShort forms, where all controls are easily in view without scrolling, form summary is generally not necessary, since all the errors are already in view."
        }
      ]
    },
    {
      "title": "Do's and Don'ts",
      "cols": "2",
      "columns": [
        {
          "type": "do",
          "dolist": [
            {
              "text": "Use clear labels and error messages for all form controls. The same labels and errors vill be shown in the form summary."
            }
          ]
        },
        {
          "type": "dont",
          "dontlist": [
            {
              "text": "Use the form summary component for small forms with only a few controls."
            }
          ]
        }
      ]
    }
  ]
}