{
  "title": "Menu button",
  "slug": "menu-button",
  "hero_snippet": "hero-menu-button",
  "beta": false,
  "soon": false,
  "summary": "A menu button combines button and link behaviors for navigation menus.",
  "preamble": "The menu button is used to build a navigation bar. It helps users find their way by linking to sections on current page or other pages. The button can include text and an optional icon.",
  "anatomy": true,
  "anatomy-list": {
    "anatomyitems": [
      {
        "text": "Link text"
      },
      {
        "text": "Trailing icon"
      },
      {
        "text": "Leading icon"
      },
      {
        "text": "Container"
      },
      {
        "text": "Selected decoration"
      }
    ]
  },
  "tags": [
    "navigation",
    "button"
  ],
  "category": [
    "Components"
  ],
  "platform": {
    "web": true,
    "ios": false,
    "android": false
  },
  "overview": [
    {
      "title": "Usage",
      "tag": "H2",
      "section-content": "Use the menu button to create clear and accessible navigation. Choose the appropriate combination of text and icon depending on the context:\n\n*   **Text only** is best for straightforward links where the label clearly communicates the destination.\n    \n*   **Text with icon** adds clarity, especially when the icon reinforces the meaning (e.g., a user icon for profile-related links).\n    \n*   **Icon only** can be used when space is limited, but only if the icon is widely recognized and its meaning is clear.\n    \n\nMenu buttons have a selected state that visually indicate the current page or section."
    },
    {
      "title": "Sizes",
      "tag": "H2",
      "section-content": "The menu button comes in three sizes to fit different layout needs and navigation contexts: \n\n*   **Large** - Typically used in primary navigation where space allows for larger, more prominent buttons. It provides good readability and clear touch targets.\n    \n*   **Medium** - Works well when space is limited but readability and clarity are still important.\n    \n*   **Small** - Optimized for tighter layouts and smaller viewports. The text and icon are vertically aligned to maintain visual balance in compact spaces, such as in mobile navigation or secondary toolbars.\n    \n\nRegardless of size, the height of the menu button will adapt to match the height set by the container. This ensures consistent alignment and spacing across the entire navigation."
    },
    {
      "title": "Do's and don'ts",
      "cols": "2",
      "columns": [
        {
          "type": "do",
          "dolist": [
            {
              "text": "Combine text and icons when it helps clarify the purpose of the button especially for actions like profile, help, or settings."
            },
            {
              "text": "Keep button labels short and descriptive to avoid crowding the navigation bar."
            }
          ]
        },
        {
          "type": "dont",
          "dontlist": [
            {
              "text": "Don't mix different sizes of menu buttons within the same navigation bar."
            },
            {
              "text": "Don't rely on icon-only buttons unless the icon’s meaning is universally understood."
            },
            {
              "text": "Don't use menu buttons for actions unrelated to navigation."
            }
          ]
        }
      ]
    }
  ],
  "ux-text": [
    {
      "title": "Writing UX text for menu buttons",
      "tag": "H2",
      "section-content": "Menu buttons help users navigate clearly and quickly. Use clear, concise text so users immediately understand where they’re going. Unlike most other buttons, the menu button doesn’t need to include a verb.\n\n#### Best practices\n\n*   **Use short, simple text** – ideally 1–2 words\n    \n*   **Be descriptive** – the text should make the destination obvious\n    \n*   **Use sentence case** – capitalise only the first word (e.g. _Profile_, _Settings_)\n    \n*   **Avoid unnecessary words** – write _Profile_ instead of _Go to profile page_"
    }
  ]
}