{
  "title": "Radio",
  "slug": "radio",
  "hero_snippet": "hero-radio",
  "beta": true,
  "soon": false,
  "summary": "A radio button is a form element that allows users to select one of the predefined set of choices.",
  "preamble": "Radio buttons are commonly used in forms, surveys, and settings where users need to make a single selection from a list of options.\nThe benefit of using radio buttons over select is that users may easily scan the available options and make a quick selection",
  "anatomy": true,
  "anatomy-overview": "The radio button (and other form controls) are divided in sections that are re-used between components.\n\n*   **Header**: Label, label support, contextual help, extended support.\n    \n*   **Body**: The radio button.\n    \n*   **Footer**: Error message.",
  "anatomy-list": {
    "anatomyitems": [
      {
        "text": "Label"
      },
      {
        "text": "Label support text"
      },
      {
        "text": "Info icon"
      },
      {
        "text": "Extended label support text"
      },
      {
        "text": "Radio button and label"
      },
      {
        "text": "Label support text"
      }
    ]
  },
  "tags": [
    "Form"
  ],
  "category": [
    "Components"
  ],
  "platform": {
    "web": true,
    "ios": false,
    "android": false
  },
  "compare": "Checkbox",
  "overview": [
    {
      "title": "Variants",
      "section-content": "*   **Default**\n    \n*   **Contained**: used only in combination with other contained form components.\n    \n*   **Contained extended(coming soon)**: The contained version but including Label support text.",
      "cols": "2",
      "columns": [
        {
          "type": "figma",
          "caption": "Default radio button.",
          "node": "variant-1"
        },
        {
          "type": "figma",
          "caption": "Contained radio button.",
          "node": "variant-2"
        }
      ]
    },
    {
      "title": "Features",
      "cols": "2",
      "columns": [
        {
          "type": "rich-text",
          "title": "Label",
          "tag": "H3",
          "content": "All individual radio buttons must have a label to ensure clarity and accessibility. When radio buttons are grouped, the group must have a header label. Labels help users understand the purpose of the radio buttons, including those using assistive technologies."
        },
        {
          "type": "figma",
          "caption": "Radio button labels.",
          "node": "label"
        },
        {
          "type": "rich-text",
          "title": "Label support",
          "tag": "H3",
          "content": "This can be used for both the header and individual radio buttons. Use this to explain how to fill in the field, for example how to count or what to include. Contained radio buttons don’t have support text for the individual radio buttons."
        },
        {
          "type": "figma",
          "caption": "Radio buttons with support texts.",
          "node": "label-support-text"
        }
      ]
    },
    {
      "title": "Contextual help",
      "section-content": "If the label and support text are not enough to explain a field, we can use the info icon. Clicking the icon shows additional support text between the label support and the field.\n\n*   Use a tooltip if space is limited.\n    \n*   Use a modal for large amounts of text.",
      "cols": "2",
      "columns": [
        {
          "type": "figma",
          "caption": "Info icon button to reach help.",
          "node": "contextual-1"
        },
        {
          "type": "figma",
          "caption": "Extended support visible.",
          "node": "contextual-2"
        }
      ]
    },
    {
      "title": "Error message",
      "section-content": "If an error occurs we mark the entire group of options with error. The error is described with an error message.",
      "cols": "2",
      "columns": [
        {
          "type": "figma",
          "caption": "Default radio buttons with error.",
          "node": "error-default"
        },
        {
          "type": "figma",
          "caption": "Extended support visible.",
          "node": "error-contained"
        }
      ]
    },
    {
      "title": "Behaviour",
      "section-content": "*   **Mutual exclusivity**: Only one radio button within a group can be selected at a time.\n    \n*   **Defaults**: Aim for having one option pre-selected."
    },
    {
      "title": "Alignment",
      "section-content": "We can align the radio buttons both horizontal and vertical.\n\n*   **Vertical**: This is the default alignment. It's easier to read and scan the available options.\n    \n*   **Horizontal**: Only used for a small set of options if the page shouldn't be to long, but try to avoid.",
      "cols": "2",
      "columns": [
        {
          "type": "figma",
          "caption": "Default radio buttons with vertical alignment.",
          "node": "alignment-1"
        },
        {
          "type": "figma",
          "caption": "Default radio buttons with horizontal alignment.",
          "node": "alignment-2"
        },
        {
          "type": "figma",
          "caption": "Contained radio buttons with vertical alignment.",
          "node": "alignment-3"
        },
        {
          "type": "figma",
          "caption": "Contained radio buttons with horizontal alignment.",
          "node": "alignment-4"
        }
      ]
    },
    {
      "title": "Do's and don'ts",
      "cols": "2",
      "columns": [
        {
          "type": "do",
          "dolist": [
            {
              "text": "Have at least two options."
            }
          ]
        },
        {
          "type": "dont",
          "dontlist": [
            {
              "text": "Don’t use radio buttons for non-mutually exclusive options; consider checkboxes instead."
            },
            {
              "text": "Don’t overwhelm users with too many radio buttons on a single page or form. If you need to show many options, use a single select dropdown instead."
            },
            {
              "text": "Don’t mix default and contained versions."
            }
          ]
        }
      ]
    }
  ],
  "ux-text": [
    {
      "title": "Writing UX text for radio buttons",
      "tag": "H2",
      "section-content": "Keep options short, clear, and easy to scan. Make sure each choice is specific and stands on its own – users shouldn’t need extra context to understand what they’re selecting. The label above should explain what the user is choosing.",
      "cols": "1",
      "columns": [
        {
          "type": "rich-text",
          "title": "Labels",
          "tag": "H2",
          "content": "The same writing principles apply to labels for input fields, radio buttons, checkboxes, dropdowns, headings, page titles, navigation links, and other short texts."
        },
        {
          "type": "rich-text",
          "title": "Use clear and informative words",
          "tag": "H3",
          "content": "Texts should be clear and to the point. Explain exactly what information is needed."
        },
        {
          "type": "rich-text",
          "title": "Single words or full sentences",
          "tag": "H3",
          "content": "Keep texts as short as possible. Labels can be single words or full sentences. In some cases, questions work best to prompt users for the right details, such as:\n\n*   Which funds do you want to buy?\n    \n*   Is the company a financial institution?\n    \n*   How do you earn your main income?"
        }
      ]
    },
    {
      "title": "Radio button options",
      "tag": "H2",
      "section-content": "### When the answer is yes and no\n\nMatch the radio button options to the label. If the label is a yes or no question, the options should be Yes and No – nothing else.",
      "cols": "2",
      "columns": [
        {
          "type": "figma",
          "caption": "do",
          "node": "yes-no-1"
        },
        {
          "type": "figma",
          "caption": "dont",
          "node": "yes-no-2"
        }
      ]
    },
    {
      "title": "We ask the customers, they answer",
      "tag": "H3",
      "section-content": "Remember, the question is asked from our perspective, and the customer provides the answer. The label should be written in the “you” form, while the answer should be in the “I” form. However, this doesn’t mean you should always include I. Sometimes, it’s better to leave it out to avoid repetition and keep the text shorter.\n\n(Add the do and don't example from seb.io)",
      "cols": "2",
      "columns": [
        {
          "type": "snippet",
          "caption": "Do",
          "plain": false,
          "replay": false,
          "Snippet": "radio-ux-i-you-do"
        },
        {
          "type": "snippet",
          "caption": "Don't",
          "plain": false,
          "replay": false,
          "Snippet": "radio-ux-i-you-dont"
        }
      ]
    },
    {
      "title": "Be consistent",
      "tag": "H3",
      "section-content": "Keep options consistent. Decide whether they should:\n\n*   Be full sentences and start with either a capital or lowercase letter\n    \n*   End with a full stop or not\n    \n*   Be a full sentence, a phrase, or a single word\n    \n\n(Add the do and don't example from seb.io)"
    },
    {
      "title": "Keep it simple",
      "section-content": "Plain text is crucial. Customers must easily understand both the words and the context. Make sure the options cover all possible choices and are clear so everyone can fill in the form. If other options might apply, include an Other option with a space for the customer to explain.\n\n(Add the do example from seb.io)"
    }
  ],
  "accessibility": [
    {
      "section-content": "All values we measure need to pass in order to give a check on the accessibility on all our components."
    },
    {
      "title": "Important considerations",
      "section-content": "Uses default navigation: Tabs as normal and change the selected option with the arrow keys (up, down, left, and right)."
    },
    {
      "title": "Usage",
      "section-content": "For the web, the Radio and Radio Group components in Green Core are implemented to follow the radio and radiogroup role specifications and closely mimic native input type radio. If you follow all these do's and dont's all the screen-readers should work well."
    },
    {
      "title": "Do's and Dont's",
      "section-content": "*   Always provide labels for both radios and group\n    \n*   Always make sure each radio has a unique value\n    \n*   Never use radio buttons outside of a radio group\n    \n*   Never use less than two radios in a group"
    }
  ]
}