{
  "title": "Table",
  "slug": "table",
  "hero_snippet": "table-hero",
  "beta": true,
  "soon": false,
  "summary": "A table displays structured data for overview and comparison.",
  "anatomy": true,
  "anatomy-list": {
    "anatomyitems": [
      {
        "text": "Header row - Defines and labels each column"
      },
      {
        "text": "Rows - Each row represents a single item or record."
      },
      {
        "text": "Cells - Contain values aligned to the column type."
      },
      {
        "text": "Column label"
      },
      {
        "text": "Sort icon"
      },
      {
        "text": "Table container (card)"
      }
    ]
  },
  "tags": [
    "data"
  ],
  "category": [
    "Components"
  ],
  "platform": {
    "web": true,
    "ios": false,
    "android": false
  },
  "overview": [
    {
      "section-content": "The table component is used to display structured data in rows and columns. It supports overview, comparison and data-driven tasks where users need to scan or interact with multiple items. Tables should represent meaningful data relationships and must not be used for layout or visual alignment."
    },
    {
      "title": "Density",
      "section-content": "The density property allows customizing the table's visual spacing with these options:\n\n*   **Comfortable** (Default) - Standard spacing for balanced readability\n    \n*   **Compact** - Reduced spacing to maximize information density\n    \n*   **Spacious** - Increased spacing for enhanced readability"
    },
    {
      "title": "Variants",
      "section-content": "The `variant` property controls the visual style of the table container card. There are three variants available:\n\n1.  **Primary**\n    \n2.  **Secondary**\n    \n3.  **Tertiary**\n    \n\n**Naming will change on the next major release:**  \nPrimary - Neutral 01, Secondary - Neutral 02, Tertiary - Neutral 02 (Outlined boolean)."
    },
    {
      "title": "Striped",
      "section-content": "When the `striped`option is enabled, alternating background colors are applied to even rows."
    },
    {
      "title": "Sorting",
      "section-content": "Table head cells can support sorting when enabled. Sorting helps users organise data and compare values within a column.\n\n*   A sorting indicator is shown on hover when sorting is enabled.\n    \n*   Selecting a column head sorts the table by that column.\n    \n*   The sorting indicator remains visible while the column is sorted.\n    \n*   Selecting the same column head again reverses the sort order.\n    \n*   In right-aligned columns, the sorting indicator is positioned to the left, with the column label placed to the right.\n    \n*   Only one column can be sorted at a time.",
      "cols": "1",
      "columns": [
        {
          "type": "rich-text",
          "title": "Sorting guidelines",
          "tag": "H4",
          "content": "*   Enable sorting only when it adds clear value for the user.\n    \n*   Use sorting primarily for columns with comparable values, such as numbers, dates or statuses.\n    \n*   Avoid enabling sorting on columns where order is not meaningful.\n    \n*   Ensure the sorting state is clearly communicated visually."
        },
        {
          "type": "rich-text",
          "title": "Sorting accessibility considerations",
          "tag": "H4",
          "content": "*   Sorting must be available using keyboard interaction.\n    \n*   The current sort state should be communicated to assistive technologies.\n    \n*   The sorting indicator should not be the only way to convey sorting state."
        }
      ]
    },
    {
      "title": "Interactions",
      "section-content": "Tables may support interaction when it helps users complete their task. Only add interaction when it adds clear value and does not reduce clarity. Supported behaviours may include:\n\n*   Column sorting\n    \n*   Row selection\n    \n*   Bulk actions\n    \n*   Interactive cells such as links or status indicators"
    },
    {
      "title": "Cell",
      "tag": "H2",
      "section-content": "The table supports multiple cell types, each mapped to corresponding Green Design System components and their available properties. Any cell type can be used in the main value, lead or trail slot.\n\n1.  **Badge**\n    \n2.  **Image**\n    \n3.  **Icon**\n    \n4.  **Button**\n    \n5.  **Link**\n    \n6.  **Context menu**\n    \n7.  **Formatted text - Number, account, date**",
      "cols": "1"
    },
    {
      "title": "Actions",
      "section-content": "All the cell content types can be used on actions. Actions accepts an array of cell types such as buttons. When you need to use two buttons align them to the left. If you have more than two buttons use the context menu. Actions will always show in the end of the row."
    },
    {
      "title": "Formatting",
      "section-content": "**Column justification**  \nColumns are left-aligned by default, with options for right alignment and space-between layouts. This is useful for columns where values and actions need clear separation and consistent alignment across rows.\n\n**Column width and wrapping**  \nColumns can have custom width. When width is set, content will wrap within the cell.\n\n**Cell vertical alignment**  \nCells are vertically centered by default and can be aligned to the start. Start alignment is recommended when content wraps, ensuring consistent top alignment across rows.\n\n**Sortable columns**  \nColumns are left-aligned by default, with the label on the left and the sorting indicator on the right. For right-aligned columns, the sorting indicator is placed on the left and the label on the right."
    },
    {
      "title": "Responsive",
      "section-content": "When the responsive option is enabled, the table adapts its layout for smaller screens. Horizontal scrolling is used until the viewport is smaller than 760px, at which point rows are restructured into a card-like format with column names on the left and corresponding values on the right."
    },
    {
      "title": "Searchable ",
      "section-content": "If the table is searchable (set by a boolean), the header shows a search field."
    },
    {
      "title": "Settings",
      "section-content": "If you enable the settings, a dropdown for choosing columns is visable."
    },
    {
      "title": "Footer",
      "section-content": "The footer contains a pagination, ([read more about the pagination here](https://seb.io/component/pagination)), and displays an item range indicating the currently visible rows and the total number of items, for example “1–10 of 100”."
    },
    {
      "title": "Plain",
      "section-content": "When the `plain` option is enabled, the table is rendered without a header or footer, displaying only the data table."
    },
    {
      "title": "Slots",
      "section-content": "The table supports state slots for error, empty and no results states. The table header includes dedicated slots for other Green Design System components, such as dropdowns or buttons, used for filtering and exporting data."
    },
    {
      "title": "Guidelines",
      "section-content": "*   Use clear and descriptive column labels.\n    \n*   Keep the structure predictable and consistent.\n    \n*   Text content should be left-aligned for readability.\n    \n*   Numeric values should be right-aligned, preferably aligned by decimal, to support comparison.\n    \n*   Avoid repeating information in table cells when it can be communicated through the column header.",
      "cols": "1"
    },
    {
      "title": "Do's and Don'ts",
      "cols": "2",
      "columns": [
        {
          "type": "do",
          "dolist": [
            {
              "text": "Use tables for overview and comparison."
            },
            {
              "text": "You have multiple items that share the same set of attributes  (for example users, transactions, configurations or accounts)."
            },
            {
              "text": "Keep structure simple and consistent."
            },
            {
              "text": "Use clear and meaningful headers."
            }
          ]
        },
        {
          "type": "dont",
          "dontlist": [
            {
              "text": "Use tables for layout."
            },
            {
              "text": "Place long descriptive text inside cells."
            },
            {
              "text": "Mix unrelated data types in the same column."
            },
            {
              "text": "Add interaction without a clear user need."
            },
            {
              "text": "Items are standalone and do not share a common structure."
            },
            {
              "text": "The dataset is small and comparison does not add value."
            }
          ]
        }
      ]
    }
  ],
  "ux-text": [
    {
      "title": "Writing UX text for table",
      "section-content": "Tables should make information easy to scan, compare and understand at a glance. Good table writing focuses on clarity, consistency and space efficiency.",
      "cols": "1",
      "columns": [
        {
          "type": "rich-text",
          "title": "Keep the column label short and clear",
          "tag": "H3",
          "content": "Use short labels and values. Aim for one or two words in each cell whenever possible. Avoid unnecessary words or repetition. If more explanation is needed, use tooltips."
        },
        {
          "type": "rich-text",
          "title": "Units and symbols",
          "tag": "H4",
          "content": "Do not repeat units or symbols, such as %, kr or EUR, in every cell if the entire column uses the same unit. Instead, include the unit or symbol in the column heading."
        },
        {
          "type": "rich-text",
          "title": "Be careful with capital letters",
          "tag": "H4",
          "content": "Use sentence case in headings and labels. Only capitalise:\n\n*   the first word\n    \n*   proper names\n    \n*   abbreviations."
        },
        {
          "type": "rich-text",
          "title": "Handle empty values clearly",
          "tag": "H3",
          "content": "Don’t leave cells blank. Use an en dash (–) to show that a value is missing or not applicable."
        },
        {
          "type": "rich-text",
          "title": "Align content for readability",
          "tag": "H3",
          "content": "Left-align text and right-align numbers to make scanning easier."
        },
        {
          "type": "rich-text",
          "title": "Error messages or other messages in tables",
          "tag": "H3",
          "content": "Sometimes, error handling is required in tables. Keep messages concise, as space is often limited.\n\n*   Short messages can appear within a table column.\n    \n*   Longer messages should appear in a separate row beneath the relevant data.\n    \n*   Messages may include a link to a help page or another relevant page.  \n    Messages displayed below should be limited to two rows, including any links.\n    \n\nExample: If a mutual fund has been removed from our range, but the customer has not yet updated their default fund distribution, an error message will appear when they try to buy funds according to that distribution or change it.\n\n**Example message:**\n\nIt is no longer possible to trade in this fund. Please change your fund distribution."
        }
      ]
    }
  ],
  "accessibility": [
    {
      "section-content": "*   Use semantic structure so relationships between headers and cells are clear.\n    \n*   Ensure column headers are programmatically associated with their cells.\n    \n*   Provide a clear title or caption describing the purpose of the table.\n    \n*   Ensure the table remains usable on smaller screens;  \n    \\- allow horizontal scrolling when needed  \n    \\- preserve context and readability\n    \n*   If a table becomes difficult to use on mobile, consider alternative patterns."
    }
  ]
}