{
  "title": "Card",
  "slug": "card",
  "hero_snippet": "hero-card",
  "beta": true,
  "summary": "The card groups related content into a single container.",
  "preamble": "Cards are used to presents content in a visually distinct, self-contained unit. It typically acts as a container for related information, such as text, images, buttons, or other interactive elements, grouped together to convey a single idea or action. ",
  "anatomy": false,
  "anatomy-overview": "A card is a container with rounded corners and a background and content color determined by its variant. The card has one main slot where any type of content can be placed.",
  "category": [
    "Layout"
  ],
  "platform": {
    "web": true,
    "ios": false,
    "android": false
  },
  "overview": [
    {
      "title": "Usage",
      "section-content": "Cards are designed to be flexible and consistent, adhering to the design system's guidelines for typography, spacing, colors, and interaction patterns.\n\nCard background colors help guide the user’s attention, support visual hierarchy, and reinforce the overall tone of the content. Choosing the right background is about balancing clarity, emphasis, and brand expression.\n\nUse neutral tones when the content should blend seamlessly into the interface, and choose more distinctive colors when you want to draw attention or create a sense of importance or exclusivity. Be mindful not to overuse strong colors – bold choices should be intentional and meaningful.\n\nOnly the colors listed below are approved for use on cards. Alert cards follow a separate color system and are not included here. Please refrain from using any unapproved colors for card backgrounds."
    },
    {
      "title": "Variants",
      "section-content": "Card variants combine pairs of background and content colors.",
      "cols": "2",
      "columns": [
        {
          "type": "rich-text",
          "title": "1. Grey (default)",
          "content": "**Purpose:** Neutral container for standard content.  \n**Use when:** The content needs gentle separation without standing out too much."
        },
        {
          "type": "snippet",
          "caption": "Grey card",
          "plain": true,
          "replay": false
        },
        {
          "type": "rich-text",
          "title": "2. White",
          "content": "**Purpose**: Clean, high-contrast container that draws more attention.  \n**Use when**: The content is colorful, like when visualising charts."
        },
        {
          "type": "snippet",
          "caption": "White card",
          "plain": true,
          "replay": false
        },
        {
          "type": "rich-text",
          "title": "3. Brand 01 (senior green)",
          "content": "**Purpose:** Reinforces SEB's brand identity and highlights key content.  \n**Use when:** You want to add emphasis while aligning with SEB’s brand colors."
        },
        {
          "type": "snippet",
          "caption": "Brand 01 (senior green) card",
          "plain": true,
          "replay": false
        },
        {
          "type": "rich-text",
          "title": "4. Brand 02 (copper)",
          "content": "**Purpose**: Signals exclusivity, premium content, or special areas.  \n**Use when:** You want to distinguish a premium experience or area of the interface."
        },
        {
          "type": "snippet",
          "caption": "Brand 02 (copper) card",
          "plain": false,
          "replay": false
        }
      ]
    },
    {
      "title": "Grey (default)",
      "tag": "H3",
      "section-content": "**Purpose:** Neutral container for standard content.  \n**Use when:** The content needs gentle separation without standing out too much.",
      "cols": "1",
      "columns": [
        {
          "type": "snippet",
          "plain": false,
          "replay": false,
          "Snippet": "card-grey"
        }
      ]
    },
    {
      "title": "White",
      "tag": "H3",
      "cols": "1",
      "columns": [
        {
          "type": "snippet",
          "plain": false,
          "replay": false,
          "Snippet": "card-white"
        }
      ]
    },
    {
      "title": "Do's and don'ts",
      "cols": "2",
      "columns": [
        {
          "type": "do",
          "dolist": [
            {
              "text": "Maintain consistency: Follow the design system’s guidelines for typography, spacing, colors, and borders to ensure cards look cohesive across the application."
            }
          ]
        },
        {
          "type": "dont",
          "dontlist": [
            {
              "text": "Overload content: Avoid cramming too much information into a single card."
            },
            {
              "text": "Overuse cards: Avoid using cards for every piece of content; reserve them for scenarios where grouped, modular content makes sense."
            },
            {
              "text": "Make cards interactive: use interactive elements, such as buttons or links, within the card instead."
            }
          ]
        }
      ]
    },
    {
      "title": "Brand 01",
      "tag": "H3",
      "cols": "2",
      "columns": [
        {
          "type": "rich-text",
          "content": "**Purpose:** Reinforces SEB's brand identity and highlights key content.  \n**Use when:** You want to add emphasis while aligning with SEB’s brand colors."
        },
        {
          "type": "snippet",
          "plain": false,
          "replay": false,
          "Snippet": "card-brand-01"
        }
      ]
    }
  ]
}