{
  "title": "Select",
  "slug": "select",
  "hero_snippet": "hero-select",
  "beta": true,
  "soon": false,
  "summary": "A select enables the user to choose one or multiple options from a list.",
  "preamble": "The select component is designed for single-choice selections, offering native mobile functionality and enhanced accessibility. Best suited for simple option lists, while maintaining familiar dropdown behaviour across devices.",
  "anatomy": false,
  "anatomy-overview": "The select (and other form controls) are divided in sections that are re-used between components.\n\n*   **Header**: Label, label support, contextual help, extended support.\n    \n*   **Body**: The field.\n    \n*   **Footer**: Error message.",
  "anatomy-details": "Details of header and footer elements are described in dropdown",
  "tags": [
    "Form",
    "select"
  ],
  "category": [
    "Components"
  ],
  "platform": {
    "web": true,
    "ios": false,
    "android": false
  },
  "compare": "Dropdown",
  "overview": [
    {
      "title": "Usage",
      "section-content": "Use this component instead of dropdown when you need to leverage the inherent behavior of the native select element, for example when native accessibility features, some of which are not currently replicable in custom dropdowns, are required. Usability on mobile devices is also sometimes better with native select elements.\n\nDon't use this component when you need to customize the dropdown behavior or appearance, or when you need to display complex content in the dropdown, or require multi-select functionality."
    },
    {
      "title": "Option list",
      "section-content": "The appearance and behavior of the option list will be handled according to each browser."
    },
    {
      "title": "Do's and don'ts",
      "cols": "2",
      "columns": [
        {
          "type": "do",
          "dolist": [
            {
              "text": "Use to leverage native select behavior "
            },
            {
              "text": "Use for single-value selections"
            }
          ]
        },
        {
          "type": "dont",
          "dontlist": [
            {
              "text": "Don't use when you need custom dropdown styling"
            },
            {
              "text": "Don't use for multi-select functionality"
            }
          ]
        }
      ]
    }
  ],
  "ux-text": [
    {
      "title": "Writing UX text for selects",
      "tag": "H2",
      "section-content": "The same text principle apply to select as dropdown.\n\n[See guidelines for dropdown](https://stg.seb.io/component/dropdown)"
    }
  ]
}