{
  "title": "Alert",
  "slug": "alert",
  "hero_snippet": "hero-alert",
  "beta": true,
  "soon": false,
  "summary": "An alert displays important messages, feedback, or time-sensitive information.",
  "preamble": "An alert is a message used to inform the user about the state of a system, page, or function. Icons and colour indicate the type and urgency of the information within the message.",
  "anatomy": true,
  "anatomy-overview": "Alert consists of a card with an icon, a message text, optional action button, and optional close button. The layout is responsive and adapts based on the size of the alert.",
  "anatomy-details": "1.  Alert card\n    \n2.  Alert border\n    \n3.  Text content\n    \n4.  Leading icon\n    \n5.  Primary action\n    \n6.  Link\n    \n7.  Icon button dismiss",
  "anatomy-list": {
    "anatomyitems": [
      {
        "text": "Alert card"
      },
      {
        "text": "Alert border"
      },
      {
        "text": "Text content"
      },
      {
        "text": "Leading icon"
      },
      {
        "text": "Primary action"
      },
      {
        "text": "Link"
      },
      {
        "text": "Icon button dismiss"
      }
    ]
  },
  "tags": [
    "Notification",
    "Feedback"
  ],
  "category": [
    "Components"
  ],
  "platform": {
    "web": true,
    "ios": false,
    "android": false
  },
  "overview": [
    {
      "title": "Variants",
      "section-content": "A set of predefined styles that convey different meanings and states through consistent visual treatment each with specific icons.",
      "cols": "2",
      "columns": [
        {
          "type": "rich-text",
          "title": "Information",
          "tag": "H3",
          "content": "Used for _passive_, non-critical updates like tips or background information. It's quiet and unobtrusive."
        },
        {
          "type": "snippet",
          "plain": false,
          "replay": false,
          "Snippet": "alert-information"
        },
        {
          "type": "rich-text",
          "title": "Notice",
          "tag": "H3",
          "content": "Used for _actionable_, attention-worthy updates that are still non-critical, like a change in a process or a reminder to do something soon."
        },
        {
          "type": "snippet",
          "plain": false,
          "replay": false,
          "Snippet": "alert-notice"
        },
        {
          "type": "rich-text",
          "title": "Positive",
          "tag": "H3",
          "content": "Confirms successful actions, such as form submissions, with a success message, optional next steps, and possible brand reinforcement."
        },
        {
          "type": "snippet",
          "plain": false,
          "replay": false,
          "Snippet": "alert-positive"
        },
        {
          "type": "rich-text",
          "title": "Warning",
          "tag": "H3",
          "content": "Highlights non-critical issues, such as upcoming deadlines, with a concise issue summary, optional duration estimate, and suggested actions."
        },
        {
          "type": "snippet",
          "plain": false,
          "replay": false,
          "Snippet": "alert-warning"
        },
        {
          "type": "rich-text",
          "title": "Negative",
          "tag": "H3",
          "content": "Communicates critical issues or errors, such as system outages, with a clear problem description, optional apology for system issues, and resolution guidance."
        },
        {
          "type": "snippet",
          "plain": false,
          "replay": false,
          "Snippet": "alert-negative-variant"
        }
      ]
    },
    {
      "title": "Action button",
      "tag": "H2",
      "section-content": "Alert supports an optional action button with customisable text to trigger relevant actions.",
      "cols": "1",
      "columns": [
        {
          "type": "snippet",
          "plain": false,
          "replay": false,
          "Snippet": "alert-action"
        }
      ]
    },
    {
      "title": "Dismissible",
      "tag": "H2",
      "section-content": "Alerts can be configured as `dismissible` in order to show a close button in the upper right corner. This also enabled closing the alert by pressing the escape key.",
      "cols": "1",
      "columns": [
        {
          "type": "snippet",
          "plain": false,
          "replay": true,
          "Snippet": "alert-dismissible"
        }
      ]
    },
    {
      "title": "Auto-dismiss",
      "tag": "H2",
      "section-content": "Alert can also be set up to use an auto-dismiss timer. In this configuration, a timer progress bar will be shown at the bottom of the alert, and the alert will close once the timer reaches the end.",
      "cols": "1",
      "columns": [
        {
          "type": "snippet",
          "plain": false,
          "replay": true,
          "Snippet": "alert-auto-dismiss"
        }
      ]
    },
    {
      "title": "Guidelines",
      "section-content": "Select the appropriate variant to match the message’s intent, such as using positive for success messages or negative for errors. Also ensure a meaningful label property is set to describe the alert’s purpose for accessibility. A label should always be set when using alert.\n\nChoose the role property carefully, using alert for critical messages and status for informational updates, to align with ARIA best practices.\n\nFor toast-like messages, like save confirmations and other non-critical messages, auto-dismiss can be used to avoid interrupting user workflows.",
      "cols": "2",
      "columns": [
        {
          "type": "do",
          "dolist": [
            {
              "text": "Use concise, clear message text to ensure quick comprehension."
            },
            {
              "text": "Enable dismissible for alerts, unless you need them to stay on screen permanently."
            }
          ]
        },
        {
          "type": "dont",
          "dontlist": [
            {
              "text": "Don’t use overly long message text."
            },
            {
              "text": "Avoid using alert role for non-critical messages; use status instead to reduce urgency."
            },
            {
              "text": "Don’t set a timeout for critical alerts that require user acknowledgment."
            },
            {
              "text": "Never omit the label property, as it’s essential for screen reader users."
            }
          ]
        }
      ]
    }
  ],
  "ux-text": [
    {
      "title": "Writing UX text for alerts",
      "tag": "H2",
      "section-content": "Keep messages clear, short, and to the point. Focus on what matters most, and make sure the message is easy to understand at a glance.\n\nAlways write with mobile users in mind – what takes up 1.5 lines on a desktop can take up 3.5 lines on a mobile screen. Aim for a maximum of 75 characters or 500 pixels wide on desktop.\n\nDo not capitalise the first letter of every word in headings or labels. Use uppercase only for:\n\n*   The first letter of the first word\n    \n*   Proper names\n    \n*   Abbreviations"
    },
    {
      "title": "Alert with a heading",
      "tag": "H3",
      "section-content": "Use a heading if it helps the customer quickly understand the message. Make sure the heading clearly reflects the content, it should do more than just say something like \"Information\". Always keep the heading on the same line as the message, not above it.\n\n(Add do and don't example)"
    },
    {
      "title": "Alert without a heading",
      "tag": "H3",
      "section-content": "It’s also fine to write the message without a heading. In some cases, the first sentence may be clear and informative enough on its own, even if it’s too long to work as a heading. Just make sure the message starts with the most important point, so the customer understands it quickly.\n\n(Add do example)"
    },
    {
      "title": "Alert with a close button (X)",
      "tag": "H3",
      "section-content": "A close button (X) lets the customer dismiss the message. If no action is needed, you don’t have to include a button, link, or X – the message can disappear on its own. For example, after logging out of online banking, a confirmation message might appear and then close automatically.\n\n(Add do example)"
    },
    {
      "title": "Alert with a button",
      "tag": "H3",
      "section-content": "Use a button when the customer needs to take a clear action. For example, to switch funds, confirm answers, or make changes in order to continue using a service.\n\nThere are some exceptions. Even when an action is required, a link may be more appropriate – for example, when the customer needs to select new mortgage terms. In this case, a link feels less urgent and gives the customer time to review the options.\n\n(Add do example)"
    },
    {
      "title": "Alert with a link",
      "tag": "H3",
      "section-content": "Use a link when:\n\n*   You want to offer more information\n    \n*   The customer needs to act on another page, but the action isn’t immediate or critical\n    \n\nYou can also use a link for critical actions if a button might feel too “committing.” For example, when a customer needs to renew their loan terms, they must take action, but a button might make them think it will be submitted straight away. A link allows them to proceed at their own pace.\n\nAlways place the link on the same line as the final sentence. It should never be placed on a new line. It can either be part of the last sentence or stand on its own, but it must always appear last in the message.\n\n(Add do example)"
    },
    {
      "title": "Using buttons and links together",
      "tag": "H3",
      "section-content": "Avoid using a button and a link in the same message. Space is limited, and mixing actions can confuse the customer. Instead, decide what the main message is. If the customer needs more information before taking action, guide them to that first – with a link – and then present the action later."
    },
    {
      "title": "Information alert",
      "tag": "H3",
      "section-content": "Use information alerts to inform customers about things like new features, updates, or proactive advice.\n\nAn information alert can include:\n\n*   **Information:** A brief message about a new feature or event, or a helpful tip\n    \n*   **Instruction:** What the customer should do next, or a required step"
    },
    {
      "title": "Success alert",
      "tag": "H3",
      "section-content": "Success alerts confirm that an action was completed successfully.\n\nWhy confirm?\n\n*   Users expect digital systems to follow social norms, including giving feedback\n    \n*   Confirmation messages reassure users that their action worked\n    \n\nA success alert should include:\n\n*   **Confirmation**: Clearly state that everything is completed and in order\n    \n*   **Instruction**: If needed, explain the next step or choice\n    \n*   **Relation** _(optional)_: Add a positive or brand-reinforcing message when appropriate\n    \n    *   For example, thank the customer when they’ve completed something sensitive, like providing KYC or private information\n        \n    *   Avoid thanking them for regular activities like payments or fund transfers"
    },
    {
      "title": "Warning alert",
      "tag": "H3",
      "section-content": "Use warning alerts for non-critical issues, such as:\n\n*   An upcoming payment due date\n    \n*   Delays in stock market price updates\n    \n*   Planned service maintenance\n    \n\nA warning message typically includes:\n\n*   **Explanation:** Describe the issue in simple terms (e.g. “Stock prices may not be up to date.”) Avoid starting with words like _Important_, _Note_, or _Warning_\n    \n*   **Estimation**: Include a time estimate for resolution, if known\n    \n*   **Apology**: Only apologise if the issue is caused by SEB’s systems\n    \n*   **Instruction**: Explain what the customer should do next, if anything. This may include a button, link, or close (X)"
    },
    {
      "title": "Critical and error alert",
      "tag": "H3",
      "section-content": "Use critical or error alerts for serious issues that prevent the user from doing what they need to – such as a system outage or service error.\n\nThe message should include:\n\n*   **Explanation**: Clearly explain what’s wrong. Don't begin with words like _Important_ or _Note_\n    \n*   **Apology**: Only when SEB’s systems are responsible for the issue\n    \n*   **Help or instruction**: Tell the customer what to do to move forward – either immediately or later"
    }
  ]
}