{
  "pages": [
    {
      "title": "About",
      "slug": "about",
      "summary": "Green Design System is the design system for Skandinaviska Enskilda Banken to make it easier and faster to build beautiful digital products and experiences under the SEB brand.",
      "path": "pages/about/about.json"
    },
    {
      "title": "Accessibility",
      "slug": "accessibility",
      "summary": "Accessibility is central to SEB’s digital experience. The Green Design System is designed to make our services usable for everyone – improving clarity, usability, and overall experience.",
      "path": "pages/accessibility/accessibility.json"
    },
    {
      "title": "Applied design",
      "slug": "design-direction/applied-design",
      "summary": "Applied design shows how our visual design comes to life in concrete examples - with templates and clear guidance for building layouts.",
      "path": "pages/design-directionapplied-design/design-directionapplied-design.json"
    },
    {
      "title": "Visual direction",
      "slug": "design-direction/visual-direction",
      "summary": "Our visual language helps the user to navigate, make choices and solve problems. With usability and writing as core pillars the visual design inherits the brand principles in a digital context.",
      "path": "pages/design-directionvisual-direction/design-directionvisual-direction.json"
    },
    {
      "title": "Design direction",
      "slug": "design-direction",
      "summary": "At SEB, digital design is not just about aesthetics - it’s about clarity, function, and supporting the user journey. We simplify and remove obstacles, with accessibility and writing as equal parts.",
      "path": "pages/design/design.json"
    },
    {
      "title": "Figma",
      "slug": "figma",
      "summary": "Figma is our core design tool, where you’ll find everything needed to create consistent and user-friendly experiences. Components, variables, and typography styles to icons and more - all in one place.",
      "path": "pages/figma/figma.json"
    },
    {
      "title": "Primitives",
      "slug": "primitives",
      "summary": "The primitives represent the fundamental parts of the design system like colors, typography, spacing, and sizing. This ensures consistency across the entire design system.",
      "path": "pages/foundation/foundation.json"
    },
    {
      "title": "Colours",
      "slug": "primitives/colours",
      "summary": "Colour is a powerful tool in design, shaping hierarchy, guiding attention, and reinforcing brand identity. In Green, colours work alongside whitespace and typography to create clarity and balance.",
      "path": "pages/foundationcolours/foundationcolours.json"
    },
    {
      "title": "Design tokens",
      "slug": "primitives/design-tokens",
      "summary": "Design tokens capture colors, typography, spacing, and other design decisions as named, reusable values used in designs, tools, and code - keeping interfaces consistent and easy to update.",
      "path": "pages/foundationtokens/foundationtokens.json"
    },
    {
      "title": "Typography",
      "slug": "primitives/typography",
      "summary": "Typography plays a crucial role in shaping the look and feel of our design. It not only impacts readability but also establish our brand identity.",
      "path": "pages/foundationtypography/foundationtypography.json"
    },
    {
      "title": "Declarative layout",
      "slug": "primitives/declarative-layout",
      "summary": "A micro-frontend optimized layout system for responsive layouts without utility classes. The relationships between elements rely on the set rules for spacing, grids, and sizing, ensuring consistency throughout.",
      "path": "pages/layout/layout.json"
    },
    {
      "title": "Icons",
      "slug": "primitives/icons",
      "summary": "Icons are a powerful tool in the interface. When used consistently, icons strengthen brand expression, improve usability, and create a more intuitive experience.",
      "path": "pages/primitivesicon/primitivesicon.json"
    },
    {
      "title": "Patterns",
      "slug": "primitives/patterns",
      "summary": "Patterns are reusable solutions to common design problems. They show how components, behaviour, and guidelines work together to meet a specific user or interface need.",
      "path": "pages/primitivespatterns/primitivespatterns.json"
    },
    {
      "title": "Shadows",
      "slug": "primitives/shadows",
      "summary": "Shadows help define hierarchy, depth, and interaction. In Green, they work together with other primitives to support clarity and visual balance.",
      "path": "pages/primitivesshadows/primitivesshadows.json"
    },
    {
      "title": "Spacings",
      "slug": "spacings",
      "summary": "Spacing is a fundamental tool for structuring layouts. In Green, we use spacing to create hierarchy, balance, and visual rhythm, making interfaces feel intentional and easy to navigate.",
      "path": "pages/spacings/spacings.json"
    },
    {
      "title": "Button groups",
      "slug": "spacings/button-groups",
      "summary": "Button spacing helps create clear relationships between actions and ensures buttons feel balanced within a layout. The spacing depends on how the buttons are arranged, side by side or stacked, and should always feel visually connected to the surrounding form or content.",
      "path": "pages/spacingsspacings-for-button-groups/spacingsspacings-for-button-groups.json"
    },
    {
      "title": "Forms",
      "slug": "spacings/forms",
      "summary": "Good spacing makes forms easier to read, scan, and complete. It helps users see how fields relate to each other, creates a clear hierarchy, and ensures enough room for focus states and touch targets. Consistent spacing makes forms feel structured and effortless to use.",
      "path": "pages/spacingsspacings-in-forms/spacingsspacings-in-forms.json"
    },
    {
      "title": "Typography",
      "slug": "spacings/typography",
      "summary": "Spacing in typography defines the structure and relationships between text elements such as headings, preambles, and body text. It should be used consistently to create a clear and predictable text hierarchy.",
      "path": "pages/spacingstypography/spacingstypography.json"
    },
    {
      "title": "UX writing",
      "slug": "ux-writing",
      "summary": "Wherever customers meet us, their experience of SEB should be consistent. A good experience builds trust and can lead to new business. Customer-facing text must be correct – mistakes distract and reduce credibility.",
      "path": "pages/ux-writing/ux-writing.json"
    }
  ],
  "total": 19,
  "lastUpdated": "2026-01-19T15:12:51.424Z"
}