{
  "pages": [
    {
      "title": "About",
      "slug": "about",
      "summary": "Green Design System is the design system for Skandinaviska Enskilda Banken to make it easier and faster to build beautiful digital products and experiences under the SEB brand.",
      "path": "pages/about/about.json"
    },
    {
      "title": "Accessibility",
      "slug": "accessibility",
      "summary": "Accessibility is central to SEB’s digital experience. The Green Design System is designed to make our services usable for everyone – improving clarity, usability, and overall experience.",
      "path": "pages/accessibility/accessibility.json"
    },
    {
      "title": "Applied design",
      "slug": "design-direction/applied-design",
      "summary": "SEB's visual design is intuitive, unified, and sophisticated, prioritizing quality craftsmanship. Our guiding words – Clean, Clear, and Craft – are fundamental to our daily design approach. These guidelines serve as a practical resource to ensure the creation of designs of the highest standard.",
      "path": "pages/design-directionapplied-design/design-directionapplied-design.json"
    },
    {
      "title": "Visual direction",
      "slug": "design-direction/visual-direction",
      "summary": "With our visual language we help the user to navigate, make choices and solve problems. It’s what makes the design direction come to life! With usability and writing as core pillars the visual design inherits the brand principles in a digital context.",
      "path": "pages/design-directionvisual-direction/design-directionvisual-direction.json"
    },
    {
      "title": "Design direction",
      "slug": "design-direction",
      "summary": "Following the brand values for SEB the Digital design direction is not just about aesthetics, it’s about clarity, function, and enhancing the user journey. In our complex world, we aim to simplify and remove obstacles for all our users. There for all aspects of design is part of the experience, such as writing and accessibility.\n\nSo the user experience will be clear, seamless and engaging.",
      "path": "pages/design/design.json"
    },
    {
      "title": "Primitives",
      "slug": "primitives",
      "summary": "The fundamental parts of the design system that supports all of SEB's interfaces such as colours and typography.",
      "path": "pages/foundation/foundation.json"
    },
    {
      "title": "Colours",
      "slug": "primitives/colours",
      "summary": "Colour is a powerful tool in design, shaping hierarchy, guiding attention, and reinforcing brand identity. In Green, colours work alongside whitespace and typography to create clarity and balance.",
      "path": "pages/foundationcolours/foundationcolours.json"
    },
    {
      "title": "Design tokens",
      "slug": "primitives/design-tokens",
      "summary": "Design tokens capture colors, typography, spacing, and other atomic design decisions as named, reusable values that are used in designs, tools and code so interfaces stay consistent and easy to update.",
      "path": "pages/foundationtokens/foundationtokens.json"
    },
    {
      "title": "Typography",
      "slug": "primitives/typography",
      "summary": "Our typography guidelines outline how to use font styles, sizes,  and weights effectively across different elements, from headings  and body text to small UI details.",
      "path": "pages/foundationtypography/foundationtypography.json"
    },
    {
      "title": "UX writing",
      "slug": "ux-writing",
      "summary": "Wherever customers meet us, their experience of SEB should be consistent. A good experience builds trust and can lead to new business. Customer-facing text must be correct – mistakes distract and reduce credibility.",
      "path": "pages/ux-writing/ux-writing.json"
    }
  ],
  "total": 10,
  "lastUpdated": "2025-08-18T11:04:10.489Z"
}