{
  "pages": [
    {
      "title": "About",
      "slug": "about",
      "summary": "Green Design System is the design system for Skandinaviska Enskilda Banken to make it easier and faster to build beautiful digital products and experiences under the SEB brand.",
      "path": "pages/about/about.json"
    },
    {
      "title": "Accessibility",
      "slug": "accessibility",
      "summary": "Accessibility is a essential part of our digital experience. Approximately 20% of people experience permanent, temporary, or situational difficulties when using websites that lack accessible design. By creating an inclusive environment, we make our services easier to use for everyone — improving clarity, usability, and overall experience.",
      "path": "pages/accessibility/accessibility.json"
    },
    {
      "title": "Foundation",
      "slug": "foundation",
      "summary": "The fundamental parts of the design system that supports all of SEB's interfaces such as colour and typography.",
      "path": "pages/foundation/foundation.json"
    },
    {
      "title": "Colours",
      "slug": "foundation/colours",
      "summary": "Colour is a powerful tool in design, shaping hierarchy, guiding attention, and reinforcing brand identity. In Green, colours work alongside whitespace and typography to create clarity and balance.",
      "path": "pages/foundationcolours/foundationcolours.json"
    },
    {
      "title": "Tokens",
      "slug": "foundation/tokens",
      "summary": "Tokens capture colors, typography, spacing, and other atomic design decisions as named, reusable values that are used in designs, tools and code so interfaces stay consistent and easy to update.",
      "path": "pages/foundationtokens/foundationtokens.json"
    },
    {
      "title": "Typography",
      "slug": "foundation/typography",
      "summary": "Our typography guidelines outline how to use font styles, sizes,  and weights effectively across different elements, from headings  and body text to small UI details.",
      "path": "pages/foundationtypography/foundationtypography.json"
    },
    {
      "title": "UX writing",
      "slug": "ux-writing",
      "summary": "Regardless of where, when or how the customer meets us, the experience of SEB must be the same because each meeting contributes to how we are perceived. A positive customer experience opens the door to new business. This is particularly important in texts aimed at customers. Mistakes affect the reader's concentration on the content and understanding of the text. Because our texts are correct, our credibility with customers and other visitors increases.",
      "path": "pages/ux-writing/ux-writing.json"
    }
  ],
  "total": 7,
  "lastUpdated": "2025-08-11T09:08:53.405Z"
}