{
  "title": "Foundation",
  "slug": "foundation",
  "summary": "The fundamental parts of the design system that supports all of SEB's interfaces such as colours and typography.",
  "sections": [
    {
      "max-width": false,
      "cols": "1",
      "columns": [
        {
          "type": "image",
          "src": "/assets/foundation_img_2.png"
        }
      ]
    },
    {
      "title": "Colours",
      "max-width": true,
      "cols": "1",
      "columns": [
        {
          "type": "paragraph",
          "tag": "p",
          "text": "Based on our brand colors, we have developed a comprehensive palette of tints for each. These extended palettes allow for greater versatility and nuance, ensuring consistency and depth across all visual elements.\n"
        },
        {
          "type": "paragraph",
          "tag": "p"
        }
      ]
    },
    {
      "title": "Typography",
      "tag": "H2",
      "max-width": true,
      "cols": "1",
      "columns": [
        {
          "type": "paragraph",
          "tag": "p",
          "text": "Typography plays a crucial role in shaping the look and feel of our design. It not only impacts readability but also helps establish a consistent visual identity, guiding users through content with clarity  and hierarchy. "
        },
        {
          "type": "paragraph",
          "tag": "p",
          "text": "By maintaining consistency in typography, we create a cohesive user experience that enhances communication, reinforces brand identity, and improves overall design aesthetics."
        },
        {
          "type": "paragraph",
          "tag": "p",
          "text": "Our typography guidelines outline how to use font styles, sizes,  and weights effectively across different elements, from headings  and body text to small UI details."
        }
      ]
    },
    {
      "max-width": false,
      "cols": "1",
      "columns": [
        {
          "type": "image",
          "src": "/assets/metallic-surface.jpg"
        }
      ]
    },
    {
      "title": "Icons",
      "max-width": true,
      "cols": "1",
      "columns": [
        {
          "type": "paragraph",
          "tag": "p",
          "text": "Icons are small symbols that help users quickly identify actions and categories. In Green, we use the Central Icon System by Iconist. "
        },
        {
          "type": "paragraph",
          "tag": "p",
          "text": "These icons are designed on a 24x24 px grid with a 2 px safe area, resulting in a 20x20 px live area for optimal clarity and balance."
        }
      ]
    }
  ]
}