{
  "title": "Accessibility",
  "slug": "accessibility",
  "summary": "Accessibility is a essential part of our digital experience. Approximately 20% of people experience permanent, temporary, or situational difficulties when using websites that lack accessible design. By creating an inclusive environment, we make our services easier to use for everyone — improving clarity, usability, and overall experience.",
  "sections": [
    {
      "title": "Accessibility checklist",
      "tag": "H2",
      "cols": "1",
      "columns": [
        {
          "type": "rich-text",
          "content": "Every component in Green Design System has accessibility in mind. For each component, we review the following areas:\n\n*   Contrast\n    \n*   Keyboard navigation\n    \n*   ARIA & HTMEL semantics\n    \n*   Focus behaviour\n    \n*   Touch interactions\n    \n*   Screen reader support\n    \n*   Darkmode compatibility"
        }
      ]
    },
    {
      "title": "Contrast",
      "tag": "H2",
      "cols": "1",
      "columns": [
        {
          "type": "rich-text",
          "title": "The importance of high contrast",
          "tag": "H3",
          "content": "High contrast ratios make content easier to read and navigate — especially for users with visual impairments. Strong contrast helps differentiate text, components, and sections on a page. By meeting accessibility standards, we ensure our content works for a wider audience, including those with significant vision difficulties."
        },
        {
          "type": "rich-text",
          "title": "What we check for contrast and colour",
          "tag": "H3",
          "content": "We evaluate the contrast between elements to ensure readability and clarity. Components should have sufficient contrast between text, icons, backgrounds, and borders. Colours must be clearly distinguishable, even for users with colour vision deficiencies. When needed, we also use patterns or icons to support meaning and improve accessibility."
        },
        {
          "type": "rich-text",
          "title": "Tools and standards we follow",
          "tag": "H3",
          "content": "*   **WCAG 2.1 - SC.1.4.3:** Follow contrast ratio of 3:1 to 4.5:1, depending on text size and usage.\n    \n*   **Chrome DevTools:** Use the **Rendering > Emulate vision deficiencies** feature to see how designs appear to users with various vision conditions.\n    \n*   **Silktide (Chrome extension):** Offers a wide range of accessibility tools, including color blindness simulation. Approved for use within SEB.\n    \n*   Contrast checkers: Tools like [WebAIM Contrast Checker](https://www.figma.com/design/d3bf8YtNaXdACoec7bY1p7/Green-documentation-site?node-id=5961-4888&m=dev) help you verify if color combinations meet contrast requirements."
        },
        {
          "type": "rich-text",
          "title": "Future high contrast mode",
          "tag": "H3",
          "content": "In addition to the dark mode feature detailed below, we may introduce a high contrast mode in the future. This setting is becoming increasingly common on other websites. While it may not be the most visually appealing, it will enhance readability in poor lighting conditions, on suboptimal screens, or for users with visual impairments."
        }
      ]
    },
    {
      "title": "Keyboard navigation",
      "tag": "H2",
      "cols": "1",
      "columns": [
        {
          "type": "rich-text",
          "content": "How to use the keyboard with this component. If something is deviating from the standards.\n\n*   You can open, press, or run the component using the Enter and/or Space keys\n    \n*   You can navigate using the arrow keys when applicable\n    \n*   You can enter text when applicable, with clear indications when text entry is not possible.\n    \n*   Please note that disabled fields should be avoided. These fields cannot be clicked or written in, and often do not provide an explanation as to why. Additionally, they typically have poor contrast."
        }
      ]
    },
    {
      "cols": "1",
      "columns": [
        {
          "type": "rich-text",
          "title": "Aria & html",
          "tag": "H2",
          "content": "Follows Aria Attributes and Roles. Uses correct html with no unnecessary aria. Common misstakes are:\n\n*   Misspelled - eg id's are case sensitive.\n    \n*   Too much - using extra aria where it is not needed."
        },
        {
          "type": "rich-text",
          "title": "Focus",
          "tag": "H2",
          "content": "If focus is implemented correctly:\n\n*   There should typically be a black focus ring a few pixels away from the element.\n    \n*   Does the focus appear when using the keyboard, but not the mouse?\n    \n*   Is it sufficiently visible? Are any parts of it hidden behind other elements or outside the window?\n    \n*   Is the focus order logical? Typically, the focus order should start from the top left, move to the top right, and then proceed downwards, continuing from left to right.\n    \n*   Do focus traps work effectively? Focus traps should ensure that popups and modals prevent users from interacting with elements outside them, whether using a mouse, keyboard, or screen readers."
        },
        {
          "type": "rich-text",
          "title": "Touch",
          "tag": "H2",
          "content": "Touch surfaces big enough and fits the visuals.\n\n*   Hand gestures like: Pinching/zooming/scrolling works.\n    \n*   AA 24px, AAA 44px - Min size (44px, but an be 24px touch area outside).\n    \n*   [https://www.w3.org/WAI/WCAG21/Understanding/target-size.html](https://www.w3.org/WAI/WCAG21/Understanding/target-size.html)\n    \n*   [https://www.w3.org/WAI/WCAG22/Understanding/target-size-minimum.html](https://www.w3.org/WAI/WCAG22/Understanding/target-size-minimum.html)\n    \n*   [https://accessibility.digital.gov/ux/touch-targets/](https://accessibility.digital.gov/ux/touch-targets/)"
        },
        {
          "type": "rich-text",
          "title": "Screen reader",
          "tag": "H2",
          "content": "Works well with screen-readers.\n\n*   Usually test on: NVDA, VoiceOver (MacOS / iOS), & TalkBack (Android).\n    \n*   Can jump between headers? Which is the most common way of using a screen-reader.\n    \n*   Read out everything that can be seen (except images that have no real meaning)."
        },
        {
          "type": "rich-text",
          "title": "Dark mode",
          "tag": "H2",
          "content": "If the components support dark mode - and how well it does it.\n\n*   What changes? Maybe nothing?\n    \n*   Something broken?"
        },
        {
          "type": "rich-text",
          "title": "Summary",
          "tag": "H2",
          "content": "How is accessible is the Green Design System?\n\nOverall, the design system is accessible. However, we occasionally encounter issues, and new ones are reported from time to time. If you identify any accessibility problems, please assist us by submitting a new issue."
        }
      ]
    }
  ]
}