{
  "title": "Design direction",
  "slug": "design-direction",
  "summary": "At SEB, digital design is not just about aesthetics - it’s about clarity, function, and supporting the user journey. We simplify and remove obstacles, with accessibility and writing as essential parts.",
  "sections": [
    {
      "max-width": false,
      "cols": "1",
      "columns": [
        {
          "type": "image",
          "src": "/assets/designdirection.jpg"
        }
      ]
    },
    {
      "title": "Before we dive in",
      "max-width": true,
      "cols": "1",
      "columns": [
        {
          "type": "paragraph",
          "tag": "p",
          "text": "​We should always be on the user's side. We are the guardians, the safe keepers and the will for change in an ever changing world.\nKnowing how we are perceived and experienced, we can motivate change within SEB and to our users."
        },
        {
          "type": "paragraph",
          "tag": "p",
          "text": "To succeed, we need the guidance, empathy and the right tools. ​\nThis manifest is one of those tools. It’s a guide on how to make decisions, move forward and make changes that matter."
        }
      ]
    },
    {
      "title": "Aim high, shoot long! And get lost in the woods",
      "max-width": true,
      "cols": "1",
      "columns": [
        {
          "type": "paragraph",
          "tag": "p",
          "text": "With the backing of our design system, guidance and community we can focus on the parts that matter: Creating user experiences that are proactive and drive the bank forward."
        },
        {
          "type": "paragraph",
          "tag": "p",
          "text": "We might shoot to high and miss the target, but we have gained momentum and new knowledge.\nThe path to the best solutions are seldom straight and the end goal will change, so stay agile and vigilant."
        },
        {
          "type": "paragraph",
          "tag": "p",
          "text": "And if you get lost along the way, just embrace it! New insights trigger innovation!"
        }
      ]
    },
    {
      "title": "How do we build on our brand tolerance?",
      "max-width": true,
      "cols": "1",
      "columns": [
        {
          "type": "paragraph",
          "tag": "p",
          "text": "As we’ve said before, design isn’t a straight path – it’s a journey from problem to solution."
        },
        {
          "type": "paragraph",
          "tag": "p",
          "text": "That journey can be messy, unpredictable, and full of twists and turns. It’s what we call VUCA: volatile, uncertain, complex, and ambiguous. Things will change, and the direction begins to change the moment you start."
        },
        {
          "type": "paragraph",
          "text": "That’s why our design system, governance, and community are key to staying on track and succeeding together."
        }
      ]
    },
    {
      "title": "So, what should an SEB experience feel like?",
      "max-width": true,
      "cols": "1",
      "columns": [
        {
          "type": "paragraph",
          "tag": "p",
          "text": "First and foremost, it’s about the volume and tone we use when we communicate with our users. Are we being calm and clear, or loud and overwhelming?"
        },
        {
          "type": "paragraph",
          "tag": "p",
          "text": "Every design choice contributes to that perception. As a designer, you can’t just focus on your own part – you need to understand the whole picture and how your decisions impact the overall experience. A choice that works for your screen but clashes with the wider flow is usually not a good choice. Great experiences come from consistency, awareness, and collaboration."
        },
        {
          "type": "paragraph",
          "text": "In the Visual direction you will be able to see examples on how to combine the components to layouts."
        }
      ]
    }
  ]
}