{
  "title": "Visual direction",
  "slug": "design-direction/visual-direction",
  "summary": "Our visual language helps the user to navigate, make choices and solve problems. With usability and writing as core pillars the visual design inherits the brand principles in a digital context.",
  "sections": [
    {
      "max-width": false,
      "cols": "1",
      "columns": [
        {
          "type": "image",
          "src": "/assets/visual_direction.png"
        }
      ]
    },
    {
      "title": "Volume",
      "max-width": true,
      "cols": "1",
      "columns": [
        {
          "type": "image",
          "src": "/assets/volym.png"
        },
        {
          "type": "rich-text",
          "content": "Our visual language is like a voice that speaks to you, not at you. By adjusting its volume, we can gently raise or lower that voice to guide attention where it’s needed.\n\nWhen balanced with visual cues and keywords, it helps us lead the user in the right direction. Finding that balance is part of crafting layouts and user flows.\n\nThis voice is one of our most powerful tools – essential for shaping the overall experience."
        }
      ]
    },
    {
      "title": "Design principles",
      "max-width": true,
      "cols": "1",
      "columns": [
        {
          "type": "paragraph",
          "tag": "p",
          "text": "This design language is a direct descendant and part of the global brand identity. It caters to designers and developers with design assets and code."
        },
        {
          "type": "paragraph",
          "tag": "p",
          "text": "Together we can focus on the user and the experience we want to build, and swiftly make changes as needed."
        },
        {
          "type": "paragraph",
          "tag": "p",
          "text": "These principles are foundational and should be considered at every stage of design and development. They also reflect our global brand values in a digital context."
        }
      ]
    },
    {
      "max-width": true,
      "cols": "1",
      "columns": [
        {
          "type": "rich-text",
          "title": "Modern, yet timeless",
          "content": "​GDS is designed to feel contemporary while avoiding trends that quickly date. Our components and layouts are built to endure, balancing innovation with a sense of familiarity.\n\nThis supports long-term consistency without sacrificing relevance."
        },
        {
          "type": "rich-text",
          "title": "​Confidence. Less is more.",
          "content": "​Our design speaks with quiet authority. We rely on clarity, precision, and restraint to build trust. Every element must earn its place—interfaces are purposeful and to the point, never overloaded or ambiguous."
        },
        {
          "type": "rich-text",
          "title": "​Elegant, uncluttered, and effortless",
          "content": "​We aim for digital experiences that feel calm and intentional. Interfaces should be intuitive, reduced to only the essential elements. Through layout, spacing, and interaction, we create effortless flows that prioritize user needs over decorative excess."
        },
        {
          "type": "rich-text",
          "title": "​Attention to detail. Just like in our business.",
          "content": "​Just as our business is built on trust and precision, our design system is built on carefully crafted details. From pixel-perfect icon alignment to consistent typographic rhythm, every component is held to the highest standard. These micro-decisions add up to macro quality."
        }
      ]
    }
  ]
}