{
  "title": "Typography",
  "slug": "primitives/typography",
  "summary": "Our typography guidelines outline how to use font styles, sizes,  and weights effectively across different elements, from headings  and body text to small UI details.",
  "sections": [
    {
      "max-width": false,
      "cols": "1",
      "columns": [
        {
          "type": "image",
          "src": "/assets/typography.jpg"
        }
      ]
    },
    {
      "max-width": true,
      "cols": "1",
      "columns": [
        {
          "type": "paragraph",
          "text": "Typography plays a crucial role in shaping the look and feel of our design. It not only impacts readability but also helps establish a consistent visual identity, guiding users through content with clarity  and hierarchy. "
        },
        {
          "type": "paragraph",
          "text": "By maintaining consistency in typography, we create a cohesive user experience that enhances communication, reinforces brand identity, and improves overall design aesthetics."
        },
        {
          "type": "paragraph",
          "text": "Our typography guidelines outline how to use font styles, sizes,  and weights effectively across different elements, from headings  and body text to small UI details."
        }
      ]
    },
    {
      "title": "Weight",
      "max-width": true,
      "cols": "1",
      "columns": [
        {
          "type": "paragraph",
          "text": "Font weight is an important tool in design that helps establish hierarchy, create emphasis, and improve readability of your design. "
        },
        {
          "type": "paragraph",
          "text": "GDS – SEB SanSerif offers the weights bold, medium, the new weight book, regular and light. Our styles are using the middle spectra. Bold and light can be used in special cases."
        }
      ]
    },
    {
      "title": "Size",
      "max-width": true,
      "cols": "1",
      "columns": [
        {
          "type": "paragraph",
          "text": "Typography sizes help establish a clear visual hierarchy, guiding users through content effortlessly. Our type scale ranges from 82px down to 12px, with each size serving a specific role in structuring information effectively:"
        }
      ]
    },
    {
      "title": "Style",
      "max-width": true,
      "cols": "1",
      "columns": [
        {
          "type": "paragraph",
          "text": "Hierarchy is shown through changes in font weight, size and colors. The updated type scale categorizes styles into roles. "
        },
        {
          "type": "paragraph",
          "text": "Green type styles are defined by five roles – display, headline, preamble, body and detail. "
        },
        {
          "type": "paragraph",
          "text": "These roles are more descriptive, allowing for simpler application across a broader range of use cases, from large to small screens."
        }
      ]
    },
    {
      "title": "Display",
      "max-width": true,
      "cols": "1",
      "columns": [
        {
          "type": "paragraph",
          "tag": "p",
          "text": "Display text is meant to make a strong visual impact. Display fonts are typically used sparingly, as they are designed for aesthetics rather than long-form readability."
        },
        {
          "type": "paragraph",
          "tag": "p",
          "text": "In terms of size, display text is significantly larger than regular headings, often used for hero sections"
        }
      ]
    },
    {
      "title": "Heading",
      "max-width": true,
      "columns": [
        {
          "type": "paragraph",
          "tag": "p",
          "text": "Headings help structure content and establish a clear hierarchy in your design. Heading levels range from H1 (largest) to H6 (smallest), each serving a different purpose. "
        },
        {
          "type": "paragraph",
          "tag": "p",
          "text": "Consistent use of heading sizes helps guide users through the content, improving readability. Keep the size differences noticeable but balanced for a clean and cohesive design."
        }
      ]
    },
    {
      "title": "Preamble",
      "max-width": true,
      "cols": "1",
      "columns": [
        {
          "type": "paragraph",
          "tag": "p",
          "text": "A preamble appears below a heading and serves as a brief overview or summary that provides context or sets the tone for the content that follows."
        },
        {
          "type": "paragraph",
          "tag": "p",
          "text": "Effective use of preambles enhances user engagement and helps clarify the purpose of the section or page."
        },
        {
          "type": "paragraph",
          "tag": "p",
          "text": "In terms of size, the preamble is generally larger than body text but smaller than headings. "
        }
      ]
    },
    {
      "title": "Body",
      "max-width": true,
      "cols": "1",
      "columns": [
        {
          "type": "paragraph",
          "tag": "p",
          "text": "Body text is the main content of your design, used for paragraphs, articles and detailed information. Its primary function is readability, therefor it should be simple, clear, and consistent. "
        },
        {
          "type": "paragraph",
          "tag": "p",
          "text": "Proper line spacing and contrast also enhance clarity and user comfort when reading. Maintaining consistency in body text ensures a cohesive, user-friendly design."
        }
      ]
    },
    {
      "title": "Detail",
      "max-width": true,
      "cols": "1",
      "columns": [
        {
          "type": "paragraph",
          "tag": "p",
          "text": "Detail style is used for ui elements like buttons, form inputs and tooltips. It provides essential, concise information. "
        },
        {
          "type": "paragraph",
          "tag": "p",
          "text": "For size, detail text is set between 12px and 16px, depending on the component and context. It should be paired with adequate spacing and contrast to ensure readability. "
        },
        {
          "type": "paragraph",
          "tag": "p",
          "text": "Consistent use of detail text in UI components helps improve clarity and user experience while maintaining a clean, minimal design."
        }
      ]
    }
  ]
}