{
  "title": "Colours",
  "slug": "primitives/colours",
  "summary": "Colour is a powerful tool in design, shaping hierarchy, guiding attention, and reinforcing brand identity. In Green, colours work alongside whitespace and typography to create clarity and balance.",
  "parent": "primitives",
  "layout": "editorial",
  "sections": [
    {
      "max-width": false,
      "cols": "1",
      "columns": [
        {
          "type": "image"
        }
      ]
    },
    {
      "title": "Designing with colors",
      "max-width": true,
      "cols": "1",
      "columns": [
        {
          "type": "paragraph",
          "text": "Based on our brand colors, we have developed a comprehensive palette of tints for each one. These extended palettes allow for greater versatility and nuance, ensuring consistency and depth across all visual elements."
        }
      ]
    },
    {
      "max-width": true,
      "cols": "1",
      "columns": [
        {
          "type": "paragraph",
          "tag": "p",
          "text": "Colors in Green are translated to work in both light and dark mode. This adaptation preserves contrast, readability, and the overall visual integrity of the interface."
        }
      ]
    },
    {
      "title": "GDS colours",
      "max-width": true,
      "cols": "1",
      "columns": [
        {
          "type": "paragraph",
          "tag": "p",
          "text": "The colors are structured into four groups - background, content, border and state. Backgrounds are divided into three levels."
        },
        {
          "type": "paragraph",
          "tag": "p",
          "text": "This structured approach ensures clear visual hierarchy, making it easy to design interfaces with depth and contrast while maintaining flexibility across different layouts."
        },
        {
          "type": "rich-text",
          "title": "Background colours and levels",
          "tag": "H3",
          "content": "Background colours are grouped by their level in the interface:\n\n**L1** – the base layer of the screen  \n**L2** – structural layers like cards and modals  \n**L3** – backgrounds for components like buttons and inputs \n\nThis structure supports clarity, consistency, and a clear visual hierarchy."
        },
        {
          "type": "rich-text",
          "title": "Content colours",
          "tag": "H3",
          "content": "Content colours are used for text, icons, and other foreground elements. They guarantee readability and clear contrast against the background."
        },
        {
          "type": "rich-text",
          "title": "Border colours",
          "tag": "H3",
          "content": "Border colours are used to define the edges of components and layout sections. They help separate content and add structure to the interface."
        },
        {
          "type": "rich-text",
          "title": "State colours",
          "content": "State colours provide visual feedback for interactions. We have defined an extensive set of tokens to support customisation across components. For example primary, secondary, and tertiary buttons."
        }
      ]
    }
  ]
}