{
  "title": "Foundation",
  "slug": "foundation",
  "summary": "Green Design System, a framework designed to bring unity, efficiency, and coherent perspective to our digital experiences. Over time it will grow and evolve but always reflect our design philosophy. User needs first, being forefront and with confidence.",
  "sections": [
    {
      "title": "Tonality",
      "tag": "H2",
      "cols": "1",
      "columns": [
        {
          "type": "paragraph",
          "tag": "p",
          "text": "Our tonality is a voice that speaks to the user, we do not scream, but when needed we raise our voice to be heard. The balance in volume allows us to point the user in the right direction, wave to get noticed or whisper when needed."
        },
        {
          "type": "image",
          "src": "/assets/tonality-circles.jpg"
        }
      ]
    },
    {
      "title": "Visual style",
      "tag": "H2",
      "cols": "1",
      "columns": [
        {
          "type": "paragraph",
          "tag": "p",
          "text": "This design language is a direct descendant and part of the global brand identity. It caters to designers and developers with design assets and code. Together we can focus on the user and the experience we want to build, and swiftly make changes as needed."
        },
        {
          "type": "image",
          "src": "/assets/metallic-surface.jpg"
        }
      ]
    },
    {
      "title": "Features",
      "cols": "1",
      "columns": [
        {
          "type": "paragraph",
          "tag": "p",
          "text": "The Green Design System ensures a unified visual experience. Empowering designers and developers with versatile, accessible and coherent components."
        },
        {
          "type": "details",
          "name": "features",
          "summary": "Consistency",
          "open": false,
          "small": false,
          "content": "The Green Design System ensures a seamless and consistent visual experience across our entire product suite. Every element, from buttons to typography, is meticulously crafted, creating a cohesive and polished user interface."
        },
        {
          "type": "details",
          "name": "features",
          "summary": "Efficiency",
          "open": false,
          "small": false,
          "content": "With an extensive library of reusable components, Green Design System empowers our teams to design and develop with speed and precision. This efficiency allows for more time spent on creative innovation and less on repetitive tasks, ultimately reducing time-to-market."
        }
      ]
    }
  ]
}