{
  "title": "Forms",
  "slug": "spacings/forms",
  "summary": "Good spacing makes forms easier to read, scan, and complete. It helps users see how fields relate to each other, creates a clear hierarchy, and ensures enough room for focus states and touch targets. Consistent spacing makes forms feel structured and effortless to use.",
  "parent": "spacings",
  "layout": "editorial",
  "sections": [
    {
      "max-width": false,
      "cols": "1",
      "columns": [
        {
          "type": "image",
          "src": "/assets/form_spacing_hero.png"
        }
      ]
    },
    {
      "title": "Field layout and spacing",
      "tag": "H2",
      "max-width": false,
      "cols": "2",
      "columns": [
        {
          "type": "rich-text",
          "content": "Spacing in a field group should follow a consistent structure both vertically and horizontally, and reflect how fields are grouped semantically.\n\nField groups should be represented both visually and in code. Fields that belong together should be grouped using `<fieldset>` and `<legend>`, and the spacing should reinforce that structure."
        }
      ]
    },
    {
      "title": "Vertical spacing",
      "tag": "H3",
      "max-width": false,
      "cols": "2",
      "columns": [
        {
          "type": "rich-text",
          "content": "Vertical spacing is used to separate and define field groups. Fields within the same `<fieldset>` should have smaller spacing between them, while the space between different fieldsets should be larger. This makes the grouping clear and consistent. Use consistent vertical spacing within each fieldset and between fieldsets to create a calm, structured flow and support quick scanning."
        },
        {
          "type": "snippet",
          "plain": false,
          "replay": false,
          "Snippet": "form-spacing-vertical"
        }
      ]
    },
    {
      "title": "Horisontal spacing",
      "tag": "H3",
      "max-width": false,
      "cols": "2",
      "columns": [
        {
          "type": "rich-text",
          "content": "When fields inside the same `<fieldset>` are placed side by side, their spacing should follow the layout grid to stay consistent with the overall page structure. This means the gap adapts per breakpoint based on the grid.\n\nAvoid placing fields side by side if it risks reducing readability or accessibility, for example when labels or helper texts vary in length, or when users need to enter longer values. In those cases, stack fields vertically within the same fieldset."
        },
        {
          "type": "snippet",
          "plain": false,
          "replay": false,
          "Snippet": "form-spacing-horisontal"
        }
      ]
    },
    {
      "title": "Fieldset spacing",
      "tag": "H2",
      "max-width": false,
      "cols": "2",
      "columns": [
        {
          "type": "rich-text",
          "content": "Use consistent section spacing to build rhythm and hierarchy. As a guideline, section spacing should be about two to times larger than the spacing between fields (if field spacing is XL (24), section spacing can be 2XL (48)). If a divider is used between sections, the spacing above and below the divider can be slightly smaller since the divider already provides a visual separation.\n\nEach field group should be implemented using `<fieldset>` with a `<legend>` that describes the group. The legend acts as the group heading and provides a programmatic name for the group, ensuring that the structure is available to assistive technologies and that the visual and semantic structure stay aligned.\n\nFor example:\n\n*   **Verksamhetsinformation** should be one fieldset with its legend.\n    \n*   **Organisationens aktiekapital** should be another fieldset with its legend."
        },
        {
          "type": "snippet",
          "plain": false,
          "replay": false,
          "Snippet": "form-spacing-sections"
        }
      ]
    },
    {
      "title": "Form contexts",
      "tag": "H2",
      "max-width": false,
      "cols": "2",
      "columns": [
        {
          "type": "rich-text",
          "content": "On mobile, fields are usually displayed in a single column and stretch to full width for easier scanning and touch interaction.\n\nOn larger screens, related fields can be placed side by side within the grid, as long as readability and accessibility are maintained."
        }
      ]
    },
    {
      "title": "Spacing varies with form complexity",
      "tag": "H2",
      "max-width": false,
      "cols": "2",
      "columns": [
        {
          "type": "rich-text",
          "content": "When a form contains many fields within a group, the vertical spacing often needs to increase to avoid a dense and overwhelming appearance. For simple forms, use XL (24) between fields. For more complex forms with many fields, increase to 2XL (32). The spacing between groups can remain the same to keep a consistent rhythm."
        }
      ]
    },
    {
      "title": "Density mode",
      "max-width": false,
      "cols": "2",
      "columns": [
        {
          "type": "rich-text",
          "content": "Density variants of form components allow forms to adapt to different use cases. The default layout uses comfortable spacing for readability, while a compact version can be used in data-heavy contexts where users need to see and edit many fields at once.\n\nThe spacing between fields in a compact variant with a horisontal layout should not follow the grid in these cases, the margins need to work independently to maintain a balanced and readable form layout. The grid itself doesn’t adapt to density."
        },
        {
          "type": "snippet",
          "plain": false,
          "replay": false,
          "Snippet": "form-spacing-density"
        }
      ]
    },
    {
      "title": "Form input max width",
      "tag": "H2",
      "max-width": false,
      "cols": "2",
      "columns": [
        {
          "type": "rich-text",
          "content": "To keep forms easy to read, limit the maximum width of the form container on large screens. We have set a max width for the large components of 420px. Very wide forms can make it harder for users to follow the flow or connect labels with fields.\n\nFor the compact versions this decreases to 320 on desktop. In a mobile device input components can always take the full width."
        },
        {
          "type": "snippet",
          "plain": false,
          "replay": false,
          "Snippet": "form-spacing-max-width"
        }
      ]
    }
  ]
}