{
  "title": "UX writing",
  "slug": "ux-writing",
  "sections": [
    {
      "section-content": "Regardless of where, when or how the customer meets us, the experience of SEB must be the same because each meeting contributes to how we are perceived. A positive customer experience opens the door to new business. This is particularly important in texts aimed at customers. Mistakes affect the reader's concentration on the content and understanding of the text. Because our texts are correct, our credibility with customers and other visitors (=potential customers) increases."
    },
    {
      "title": "Written ID – our tone of voice",
      "tag": "H2",
      "section-content": "SEB's Written ID is our guiding light, and it forms the basis for all our communication, including UX writing. Our communication must show that we live and operate according to our language keys:\n\n*   **Open and personal:** We are people speaking to people. That’s why we prefer using an informal, personal voice rather than an official one.\n    \n*   **Relevant and clear:** Our texts are clear and easy to grasp, and we start with what’s most important.\n    \n*   **Driven and engaged:** We have the engagement and energy; we share our drive with our customers. Linguistically that means our language is alert and modern.\n    \n\nThe voice the customers encounter when they use a service on the internet banking services or the mobile apps must be the same in guides, sales, error messages, etc. But UX writing should, to a greater degree than other non-fiction texts, be consistent. Therefore, we have special principles for different design components.",
      "cols": "1"
    },
    {
      "title": "UX writing in SEB",
      "tag": "H2",
      "cols": "1",
      "columns": [
        {
          "type": "rich-text",
          "title": "What is UX writing and how will good UX texts help our customers?",
          "tag": "H3",
          "content": "The UX texts help the user, or customer, to navigate apps, websites, and other digital products. They are one part of many in a final design. UX texts focus on accessibility, they are short and to the point without losing any important information. They are user-friendly, contextually appropriate and with the right tone of voice. The UX texts should solve a user problem and meet the business goals.\n\nThese are many requirements to take into account and which do not always go hand in hand with each other. Therefore, people with the right knowledge and skills must write the UX texts.\n\nGood UX writing is like a personal guide that acts in the background and helps customers understand how to act and navigate. It ensures that customers do not end up in situations where they feel stupid or underestimated. Really good UX writing will rather make them feel satisfied because they succeed in finishing a task without unnecessary thresholds.\n\nUX writing in SEB is:\n\n*   Consistent – we strive to use the same word for the same item, action, or object.\n    \n*   Educational – we make an effort to be brief and pedagogic.\n    \n*   Distinct – we avoid bank or tech jargon.\n    \n*   Helpful – we prevent mistakes and setbacks."
        },
        {
          "type": "rich-text",
          "title": "A few examples of UX texts:",
          "tag": "H3",
          "content": "*   Labels and headings\n    \n*   Menus\n    \n*   Buttons, links, and navigation texts\n    \n*   Error messages\n    \n*   Help texts and instructions\n    \n*   Onboardings\n    \n*   Empty states\n    \n*   Loading screen messages\n    \n*   Success messages\n    \n*   Disclaimer texts"
        },
        {
          "type": "rich-text",
          "title": "Translate texts from Swedish to English",
          "tag": "H2",
          "content": "If you need to translate Swedish texts into English, the bank has agreements with, among others, Språkkonsulterna and Lionbridge. Contact them directly to order a translation.\n\nWhen you contact them to ask if they are available to take on the assignment, they want to know approximately how many words are to be translated. They also need to know the name of who will pay the invoice before you send the translation document.\n\n*   Språkkonsulterna: [info@sprakkonsulterna.se](mailto:info@sprakkonsulterna.se)\n    \n*   Lionbridge: [jakob.nordby@lionbridge.com](mailto:jakob.nordby@lionbridge.com)\n    \n\nWhen you need help with tone-of-voice, instructions, vocabulary or a UX writer to work with, please don’t hesitate to contact the UX writing team. Reach out in the Teams channels UX writing in Green Design System or UX writing in CX Community, or if you already have a contact or dedicated writer for your team or product, simply contact that person."
        }
      ]
    }
  ]
}