{
  "title": "UX writing",
  "slug": "ux-writing",
  "summary": "Wherever customers meet us, their experience of SEB should be consistent. A good experience builds trust and can lead to new business. Customer-facing text must be correct – mistakes distract and reduce credibility.",
  "sections": [
    {
      "title": "Our Written Identity",
      "tag": "H2",
      "section-content": "At SEB we are thousands of people in many markets and offices around the globe. A clear written identity helps us maintain a distinct voice and unified experience.  \n  \nOur Written Identity isn’t just about rules and grammar, do’s and don’ts. It's about how we express ourselves and the feeling we want to leave people with. Of course, we must write professionally, but the most important thing is communicating a clear message in a collective SEB voice. \n\n **This is how we express ourselves**\n\n1.  One voice, different levels\n    \n2.  Simplify, simplify, simplify\n    \n3.  Confident and inclusive\n    \n4.  Professional problem-solvers",
      "max-width": true,
      "cols": "1"
    },
    {
      "title": "UX writing in SEB",
      "tag": "H2",
      "max-width": true,
      "cols": "1",
      "columns": [
        {
          "type": "rich-text",
          "title": "What is UX writing and how will good UX texts help our customers?",
          "tag": "H3",
          "content": "The UX texts help the user, or customer, to navigate apps, websites, and other digital products. They are one part of many in a final design. UX texts focus on accessibility, they are short and to the point without losing any important information. They are user-friendly, contextually appropriate and with the right tone of voice. The UX texts should solve a user problem and meet the business goals.\n\nThese are many requirements to take into account and which do not always go hand in hand with each other. Therefore, people with the right knowledge and skills must write the UX texts.\n\nGood UX writing is like a personal guide that acts in the background and helps customers understand how to act and navigate. It ensures that customers do not end up in situations where they feel stupid or underestimated. Really good UX writing will rather make them feel satisfied because they succeed in finishing a task without unnecessary thresholds.\n\n**UX writing in SEB is:**\n\n*   Consistent – we strive to use the same word for the same item, action, or object.\n    \n*   Educational – we make an effort to be brief and pedagogic.\n    \n*   Distinct – we avoid bank or tech jargon.\n    \n*   Helpful – we prevent mistakes and setbacks."
        },
        {
          "type": "rich-text",
          "title": "A few examples of UX texts:",
          "tag": "H3",
          "content": "*   Labels and headings\n    \n*   Menus\n    \n*   Buttons, links, and navigation texts\n    \n*   Error messages\n    \n*   Help texts and instructions\n    \n*   Onboardings\n    \n*   Empty states\n    \n*   Loading screen messages\n    \n*   Success messages\n    \n*   Disclaimer texts"
        }
      ]
    }
  ]
}