{
  "title": "UX writing",
  "slug": "ux-writing",
  "summary": "Wherever customers meet us, their experience of SEB should be consistent. A good experience builds trust and can lead to new business. Customer-facing text must be correct – mistakes distract and reduce credibility.",
  "sections": [
    {
      "title": "Written ID – our tone of voice",
      "tag": "H2",
      "section-content": "SEB's Written ID is our guiding light, and it forms the basis for all our communication, including UX writing. Our communication must show that we live and operate according to our language keys:\n\n*   **Open and personal:** We are people speaking to people. That’s why we prefer using an informal, personal voice rather than an official one.\n    \n*   **Relevant and clear:** Our texts are clear and easy to grasp, and we start with what’s most important.\n    \n*   **Driven and engaged:** We have the engagement and energy; we share our drive with our customers. Linguistically that means our language is alert and modern.\n    \n\nThe voice the customers encounter when they use a service on the internet banking services or the mobile apps must be the same in guides, sales, error messages, etc. But UX writing should, to a greater degree than other non-fiction texts, be consistent. Therefore, we have special principles for different design components.",
      "max-width": true,
      "cols": "1"
    },
    {
      "title": "UX writing in SEB",
      "tag": "H2",
      "max-width": true,
      "cols": "1",
      "columns": [
        {
          "type": "rich-text",
          "title": "What is UX writing and how will good UX texts help our customers?",
          "tag": "H3",
          "content": "The UX texts help the user, or customer, to navigate apps, websites, and other digital products. They are one part of many in a final design. UX texts focus on accessibility, they are short and to the point without losing any important information. They are user-friendly, contextually appropriate and with the right tone of voice. The UX texts should solve a user problem and meet the business goals.\n\nThese are many requirements to take into account and which do not always go hand in hand with each other. Therefore, people with the right knowledge and skills must write the UX texts.\n\nGood UX writing is like a personal guide that acts in the background and helps customers understand how to act and navigate. It ensures that customers do not end up in situations where they feel stupid or underestimated. Really good UX writing will rather make them feel satisfied because they succeed in finishing a task without unnecessary thresholds.\n\n**UX writing in SEB is:**\n\n*   Consistent – we strive to use the same word for the same item, action, or object.\n    \n*   Educational – we make an effort to be brief and pedagogic.\n    \n*   Distinct – we avoid bank or tech jargon.\n    \n*   Helpful – we prevent mistakes and setbacks."
        },
        {
          "type": "rich-text",
          "title": "A few examples of UX texts:",
          "tag": "H3",
          "content": "*   Labels and headings\n    \n*   Menus\n    \n*   Buttons, links, and navigation texts\n    \n*   Error messages\n    \n*   Help texts and instructions\n    \n*   Onboardings\n    \n*   Empty states\n    \n*   Loading screen messages\n    \n*   Success messages\n    \n*   Disclaimer texts"
        }
      ]
    }
  ]
}